[
  {
    "id": 61,
    "title": "Перейти на предыдущий коммит без изменения истории",
    "description": "Иногда нужно изучить состояние кода в определённый момент истории, не создавая новую ветку и не меняя историю коммитов. Git позволяет checkout конкретного коммита напрямую, переводя вас в состояние 'detached HEAD'.\n\nВы подозреваете, что коммит 'abc123def' внёс баг. Переключитесь на этот конкретный коммит, чтобы изучить код на тот момент.",
    "difficulty": "Средне",
    "category": "Отладка",
    "hints": [
      "Используйте 'git checkout <commit-id>', чтобы перейти на конкретный коммит напрямую.",
      "Вы окажетесь в состоянии 'detached HEAD' — вы не находитесь ни на одной ветке.",
      "Можно использовать полный идентификатор или первые 7 символов: 'abc123d'.",
      "Используйте 'git log', чтобы увидеть доступные коммиты и их ID."
    ]
  },
  {
    "id": 62,
    "title": "Узнать, какие файлы изменились в конкретном коммите",
    "description": "Иногда нужно увидеть, какие файлы были изменены в конкретном коммите, не просматривая полный diff. Git позволяет вывести только имена изменённых файлов.\n\nИспользуйте git show, чтобы показать только имена файлов, изменённых в коммите 'abc789def' (коммит с реализацией аутентификации).",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git show --name-only <commit-id>', чтобы показать только имена изменённых файлов.",
      "Также можно использовать 'git show --name-status <commit-id>', чтобы увидеть имена и статус изменений.",
      "Коммит 'abc789def' реализует систему аутентификации пользователей."
    ]
  },
  {
    "id": 63,
    "title": "Показать изменения, внесённые коммитом",
    "description": "Иногда нужно увидеть, какие именно изменения были сделаны в конкретном коммите. Команда 'git show' показывает информацию о коммите вместе с внесёнными изменениями (diff).\n\nИспользуйте git show, чтобы отобразить изменения, внесённые коммитом 'abc123def'.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git show <commit-id>', чтобы показать изменения, внесённые конкретным коммитом.",
      "Команда git show выводит как метаданные коммита, так и фактический diff.",
      "Можно использовать полный ID коммита или только первые несколько символов."
    ]
  },
  {
    "id": 64,
    "title": "Показать коммиты в ветке, которых нет в main",
    "description": "При работе с несколькими ветками часто нужно увидеть, какие коммиты есть в feature-ветке, но ещё не попали в основную ветку. Git предоставляет несколько способов сравнить ветки и показать коммиты, присутствующие в одной ветке и отсутствующие в другой.\n\nУ вас есть ветка 'feature' с коммитами, которых нет в ветке 'master'. Используйте git log, чтобы показать только коммиты, которые есть в 'feature', но отсутствуют в 'master'.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git log master..feature', чтобы показать коммиты в feature, которых нет в master.",
      "Также можно использовать 'git log feature --not master' для того же результата.",
      "Синтаксис '..' означает 'коммиты, достижимые из правой части, но не из левой'.",
      "Добавьте '--oneline' для более компактного отображения."
    ]
  },
  {
    "id": 65,
    "title": "Показать историю конкретного файла",
    "description": "Иногда нужно увидеть историю коммитов для конкретного файла, чтобы понять, как он развивался со временем. Git позволяет отфильтровать лог и показать только коммиты, затронувшие указанный файл.\n\nВы хотите увидеть историю изменений файла 'config.js'. Используйте git log, чтобы показать только коммиты, изменявшие этот файл.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git log <filename>', чтобы показать коммиты, изменявшие конкретный файл.",
      "Также можно использовать 'git log --follow <filename>', чтобы проследить файл через переименования.",
      "Добавьте '--oneline' для более компактного отображения истории файла."
    ]
  },
  {
    "id": 66,
    "title": "Показать различия между двумя коммитами",
    "description": "Иногда нужно увидеть, что изменилось между двумя конкретными коммитами. Git позволяет сравнить любые два коммита и увидеть различия в их содержимом.\n\nВы хотите увидеть различия между коммитом 'abc123def' (баговая фича) и коммитом 'def456abc' (исправление стилей). Используйте git diff, чтобы показать изменения между этими двумя коммитами.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git diff <commit1> <commit2>', чтобы показать различия между двумя коммитами.",
      "Также можно использовать 'git diff <commit1>..<commit2>' для того же результата.",
      "Порядок важен — 'git diff A B' показывает, что изменилось от A к B.",
      "Используйте 'git log --oneline', чтобы увидеть доступные коммиты и их ID."
    ]
  },
  {
    "id": 67,
    "title": "Сравнить две ветки и увидеть различия",
    "description": "При работе с несколькими ветками часто нужно увидеть, какие изменения есть между ними. Git предоставляет несколько способов сравнить ветки и увидеть различия в их содержимом.\n\nУ вас есть ветки 'feature' и 'master'. Используйте git diff, чтобы показать различия между этими двумя ветками.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git diff <branch1> <branch2>', чтобы сравнить две ветки.",
      "Также можно использовать 'git diff <branch1>..<branch2>' для того же результата.",
      "Порядок важен — 'git diff A B' показывает, что изменилось от A к B.",
      "Используйте 'git branch', чтобы увидеть доступные ветки."
    ]
  },
  {
    "id": 68,
    "title": "Найти коммиты конкретного автора",
    "description": "Иногда нужно найти все коммиты, сделанные конкретным автором, чтобы отследить вклад или провести ревью. Git позволяет фильтровать историю коммитов по имени автора или email.\n\nВы хотите увидеть все коммиты, сделанные 'John Smith'. Используйте git log, чтобы показать только коммиты этого автора.",
    "difficulty": "Легко",
    "category": "Отладка",
    "hints": [
      "Используйте 'git log --author=\"John Smith\"', чтобы показать коммиты конкретного автора.",
      "Можно использовать частичное совпадение: 'git log --author=john' найдёт 'John Smith'.",
      "Сопоставление автора нечувствительно к регистру по умолчанию.",
      "Вы можете комбинировать --author с другими флагами, например --oneline для компактного вывода."
    ]
  },
  {
    "id": 69,
    "title": "Восстановить удалённую ветку",
    "description": "Иногда вы случайно удаляете ветку, которая ещё нужна. Git хранит сведения о том, где находились указатели веток, даже после удаления, через reflog. Можно восстановить удалённую ветку, найдя её последний коммит и создав ветку заново.\n\nВы случайно удалили ветку 'feature-login'. Используйте git reflog, чтобы найти, куда она указывала, и восстановить её.",
    "difficulty": "Средне",
    "category": "Отладка",
    "hints": [
      "Используйте 'git reflog', чтобы увидеть историю перемещений HEAD и найти, куда указывала удалённая ветка.",
      "Ищите записи вроде 'checkout: moving from feature-login to master', чтобы найти последний коммит ветки.",
      "Используйте 'git checkout -b feature-login <commit-id>', чтобы воссоздать ветку на этом коммите.",
      "Можно также использовать 'git branch feature-login <commit-id>', если вы не на ветке, которую создаёте."
    ]
  },
  {
    "id": 70,
    "title": "Найти коммит, в котором появился баг, с помощью git bisect",
    "description": "Git bisect — мощный инструмент, позволяющий найти точный коммит, в котором появился баг, методом бинарного поиска. Сначала отмечаются хороший и плохой коммиты, после чего Git направляет вас по проверке коммитов, пока не найдёт первый плохой.\n\nИзвестно, что коммит 'abc123def' — плохой (содержит баг), а коммит 'xyz789abc' — хороший (без бага). Используйте git bisect, чтобы определить, в каком коммите появился баг.",
    "difficulty": "Сложно",
    "category": "Отладка",
    "hints": [
      "Начните с 'git bisect start', чтобы запустить процесс.",
      "Используйте 'git bisect bad <commit-id>', чтобы отметить плохой коммит.",
      "Используйте 'git bisect good <commit-id>', чтобы отметить хороший коммит.",
      "Git будет переключать вас на разные коммиты для тестирования — отмечайте каждый как 'git bisect good' или 'git bisect bad'.",
      "Продолжайте, пока Git не определит первый плохой коммит.",
      "Используйте 'git bisect reset' по завершении, чтобы вернуться на исходную ветку."
    ]
  }
]