[
  {
    "id": 51,
    "title": "Сохранить незакоммиченные изменения (stash)",
    "description": "Иногда вы работаете над задачей, но нужно быстро переключиться на другую или подтянуть изменения из удалённого репозитория. Команда git stash позволяет временно сохранить незакоммиченные изменения, не создавая коммит.\n\nУ вас есть незакоммиченные изменения в рабочем каталоге. Используйте git stash, чтобы сохранить эти изменения, поработать над другим и позже к ним вернуться.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash' или 'git stash push', чтобы сохранить незакоммиченные изменения.",
      "После сохранения рабочий каталог должен быть чистым.",
      "Позже вы можете вернуть изменения с помощью 'git stash pop' или 'git stash apply'."
    ]
  },
  {
    "id": 52,
    "title": "Просмотреть список всех сохранённых изменений (stashes)",
    "description": "Git позволяет просматривать все сохранённые изменения с помощью команды stash list. Она показывает все ваши stash-записи вместе с их сообщениями и идентификаторами.\n\nУ вас есть сохранённые изменения. Используйте Git, чтобы вывести список всех сохранённых изменений.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash list', чтобы увидеть все сохранённые изменения.",
      "Каждая запись показывает идентификатор (stash@{0}, stash@{1} и т. д.) и сообщение.",
      "Самый свежий stash находится вверху списка (stash@{0})."
    ]
  },
  {
    "id": 53,
    "title": "Применить последний stash без его удаления",
    "description": "Иногда нужно применить сохранённые изменения к рабочему каталогу, но оставить запись в списке на будущее. Команда 'git stash apply' применяет изменения, не удаляя запись из списка, в отличие от 'git stash pop'.\n\nУ вас есть сохранённые изменения, которые нужно применить к рабочему каталогу, но оставить запись на будущее.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash apply', чтобы применить последний stash без удаления из списка.",
      "В отличие от 'git stash pop', 'git stash apply' сохраняет запись для дальнейшего использования.",
      "После применения можно проверить наличие записи командой 'git stash list'."
    ]
  },
  {
    "id": 54,
    "title": "Применить конкретный stash",
    "description": "Когда у вас несколько stash-записей, можно применить конкретную, указав её индекс. Каждая запись нумеруется с 0: stash@{0} — самая свежая, stash@{1} — следующая и так далее.\n\nУ вас несколько сохранённых изменений. Примените вторую запись (stash@{1}), не удаляя её из списка.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash list', чтобы увидеть все доступные записи.",
      "Используйте 'git stash apply stash@{1}', чтобы применить вторую запись.",
      "Можно также использовать короткую форму 'git stash apply 1'.",
      "Запись stash@{1} должна остаться в списке после применения."
    ]
  },
  {
    "id": 55,
    "title": "Удалить конкретный stash",
    "description": "Иногда нужно удалить определённую запись stash, не применяя её. Команда 'git stash drop' позволяет удалить конкретную запись по ссылке (stash@{1}, stash@{2} и т. д.).\n\nУ вас несколько сохранённых изменений. Удалите вторую запись (stash@{1}), не применяя её.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash list', чтобы увидеть все записи.",
      "Используйте 'git stash drop stash@{1}', чтобы удалить вторую запись.",
      "Можно также использовать короткую форму 'git stash drop 1'.",
      "Запись stash@{1} должна исчезнуть из списка после удаления."
    ]
  },
  {
    "id": 56,
    "title": "Создать stash с пользовательским сообщением",
    "description": "При сохранении изменений можно указать пользовательское сообщение, чтобы легче было понимать содержимое. Это особенно полезно, когда у вас много stash-записей и нужно помнить, для чего каждая.\n\nУ вас есть незакоммиченные изменения в рабочем каталоге. Создайте stash с пользовательским сообщением 'Work in progress on feature X'.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash push -m \"message\"', чтобы создать stash с сообщением.",
      "Также можно использовать 'git stash save \"message\"' (устаревшая форма, но работает).",
      "Сообщение должно быть: 'Work in progress on feature X'",
      "После сохранения рабочий каталог должен быть чистым."
    ]
  },
  {
    "id": 57,
    "title": "Сохранить также неотслеживаемые файлы",
    "description": "По умолчанию git stash сохраняет только отслеживаемые изменённые файлы. Иногда нужно сохранить и неотслеживаемые файлы (ещё не добавленные в Git). Используйте флаг --include-untracked, чтобы сохранить и те, и другие.\n\nУ вас есть изменённые отслеживаемые файлы и новые неотслеживаемые. Сохраните всё, включая неотслеживаемые файлы.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash -u' или 'git stash --include-untracked', чтобы сохранить и неотслеживаемые файлы.",
      "Можно также использовать 'git stash push -u' с тем же эффектом.",
      "После сохранения и отслеживаемые, и неотслеживаемые файлы должны быть сохранены, а рабочий каталог — полностью чистым."
    ]
  },
  {
    "id": 58,
    "title": "Применить и удалить последний stash (pop)",
    "description": "Команда 'git stash pop' применяет самый свежий stash к рабочему каталогу и удаляет его из списка. В отличие от 'git stash apply', 'pop' удаляет запись после применения.\n\nУ вас есть сохранённые изменения, которые нужно применить к рабочему каталогу и удалить из списка навсегда.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash pop', чтобы применить последний stash и удалить его из списка.",
      "В отличие от 'git stash apply', 'git stash pop' удаляет запись после применения.",
      "Проверьте удаление записи командой 'git stash list' после операции."
    ]
  },
  {
    "id": 59,
    "title": "Применить (pop) конкретный stash",
    "description": "Когда у вас несколько записей, можно применить и удалить конкретную запись, указав её индекс. Команда 'git stash pop' с ссылкой на запись применяет её и удаляет из списка.\n\nУ вас несколько сохранённых изменений. Примените вторую запись (stash@{1}) и удалите её из списка.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash list', чтобы увидеть доступные записи.",
      "Используйте 'git stash pop stash@{1}', чтобы применить вторую запись.",
      "Можно также использовать короткую форму 'git stash pop 1'.",
      "Запись stash@{1} должна быть удалена из списка после применения."
    ]
  },
  {
    "id": 60,
    "title": "Очистить все сохранённые изменения",
    "description": "Иногда нужно навсегда удалить все сохранённые изменения разом. Команда 'git stash clear' удаляет все записи из списка. Будьте осторожны: это безвозвратное удаление.\n\nУ вас есть несколько сохранённых изменений, которые больше не нужны. Очистите все записи stash, чтобы привести список в порядок.",
    "difficulty": "Легко",
    "category": "Сохранение изменений (stash)",
    "hints": [
      "Используйте 'git stash clear', чтобы удалить все записи сразу.",
      "Эта команда безвозвратно удаляет все сохранённые изменения — используйте с осторожностью.",
      "Проверьте, что все записи удалены, командой 'git stash list' после очистки."
    ]
  }
]