[
  {
    "id": 31,
    "title": "Исправить последний коммит без изменения сообщения",
    "description": "Иногда вы понимаете, что забыли проиндексировать файл или внесли небольшое изменение после коммита. Git позволяет исправить последний коммит, добавив дополнительные изменения, не создавая новый коммит.\n\nУ вас есть проиндексированные изменения, которые должны были войти в последний коммит. Исправьте последний коммит, чтобы включить эти изменения, не изменяя сообщение коммита.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git commit --amend --no-edit', чтобы исправить последний коммит без изменения сообщения.",
      "Флаг --amend изменяет последний коммит вместо создания нового.",
      "Флаг --no-edit сохраняет существующее сообщение коммита без изменений."
    ]
  },
  {
    "id": 32,
    "title": "Исправить последний коммит и обновить его сообщение",
    "description": "Иногда нужно изменить сообщение последнего коммита или добавить в него забытые изменения.\n\nВаш последний коммит имеет сообщение 'Add new feature', но должно быть 'Add user authentication feature'. Используйте возможность исправления коммита (amend), чтобы обновить сообщение коммита.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git commit --amend -m \"Add user authentication feature\"', чтобы изменить сообщение последнего коммита.",
      "Флаг --amend изменяет самый недавний коммит вместо создания нового.",
      "Не используйте --no-edit, так как он сохранит существующее (неверное) сообщение."
    ]
  },
  {
    "id": 33,
    "title": "Отменить последний коммит, но оставить изменения в индексе",
    "description": "Иногда вы делаете коммит слишком рано и понимаете, что хотите внести дополнительные изменения или исправить сообщение коммита. Git позволяет отменить последний коммит, оставив изменения в индексе, чтобы вы могли их доработать и закоммитить снова.\n\nВаш последний коммит был сделан преждевременно. Отмените его, но оставьте изменения в индексе, чтобы продолжить работу.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git reset --soft HEAD~1', чтобы отменить последний коммит, но оставить изменения в индексе.",
      "Флаг --soft сохраняет ваши проиндексированные изменения, в отличие от --hard, который их удаляет.",
      "HEAD~1 означает коммит перед текущим HEAD (на один коммит назад)."
    ]
  },
  {
    "id": 34,
    "title": "Отменить последний коммит и убрать изменения из индекса",
    "description": "Иногда нужно отменить коммит, но сохранить изменения в рабочем каталоге как неиндексированные файлы. Это позволяет доработать файлы перед повторным коммитом.\n\nВаш последний коммит нужно отменить, а изменения должны остаться в рабочем каталоге, но быть убраны из индекса.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git reset HEAD~1', чтобы отменить последний коммит и убрать изменения из индекса.",
      "Смешанный сброс (по умолчанию) перемещает HEAD назад и убирает файлы из индекса, но сохраняет изменения в рабочем каталоге.",
      "HEAD~1 означает коммит перед текущим HEAD (на один коммит назад)."
    ]
  },
  {
    "id": 35,
    "title": "Убрать из индекса файл, добавленный случайно",
    "description": "Иногда вы случайно индексируете файл, который не планировали включать в следующий коммит. Git позволяет убрать файл из индекса, не теряя изменения в рабочем каталоге.\n\nВы случайно проиндексировали 'temp.log', который не должен попадать в коммит. Уберите этот файл из индекса, сохранив изменения в рабочем каталоге.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git reset HEAD temp.log', чтобы убрать файл из индекса, сохранив изменения в рабочем каталоге.",
      "Также можно использовать 'git reset temp.log' как сокращённую форму для той же операции.",
      "Файл останется изменённым в вашем рабочем каталоге после удаления из индекса."
    ]
  },
  {
    "id": 36,
    "title": "Отменить незакоммиченные изменения файла",
    "description": "Иногда вы вносите изменения в файл, но понимаете, что хотите их отменить и вернуть файл к последнему закоммиченному состоянию. Git позволяет отменить изменения в рабочем каталоге, не затрагивая индекс.\n\nВы внесли изменения в 'file.txt', которые хотите отменить. Используйте Git, чтобы вернуть файл к последнему закоммиченному состоянию.",
    "difficulty": "Легко",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git checkout -- file.txt', чтобы отменить изменения файла.",
      "Также можно использовать 'git restore file.txt' (Git 2.23+) для того же эффекта.",
      "Это влияет только на незакоммиченные изменения в рабочем каталоге, а не на индексированные изменения."
    ]
  },
  {
    "id": 37,
    "title": "Откатить коммит, отправленный на удалённый репозиторий",
    "description": "Иногда нужно отменить изменения из коммита, который уже был отправлен в удалённый репозиторий. В отличие от git reset, команда git revert создаёт новый коммит, который отменяет изменения, что безопасно для общих репозиториев.\n\nУ вас есть коммит с идентификатором 'abc123def', который внёс баг и должен быть откатан. Используйте git revert, чтобы безопасно отменить его изменения.",
    "difficulty": "Средне",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git revert <commit-id>', чтобы создать новый коммит, отменяющий изменения указанного коммита.",
      "git revert безопаснее, чем git reset, для коммитов, отправленных в удалённые репозитории.",
      "Команда revert откроет редактор для сообщения коммита, либо используйте -m, чтобы указать его напрямую."
    ]
  },
  {
    "id": 38,
    "title": "Сброс ветки к предыдущему коммиту (мягкий сброс)",
    "description": "Иногда нужно сбросить ветку к предыдущему коммиту, сохранив изменения в области индексирования. Это позволяет перекоммитить изменения с другой структурой или сообщением.\n\nУ вас есть коммиты, которые нужно отменить, но вы хотите сохранить изменения в индексе. Сбросьте ветку к коммиту 'abc123def', используя мягкий сброс.",
    "difficulty": "Средне",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git reset --soft <commit-id>', чтобы сбросить состояние к указанному коммиту, сохранив изменения в индексе.",
      "Можно использовать идентификатор коммита 'abc123def' или найти его через 'git log'.",
      "Мягкий сброс перемещает HEAD назад, но сохраняет область индексирования и рабочий каталог."
    ]
  },
  {
    "id": 39,
    "title": "Сброс ветки к предыдущему коммиту (жёсткий сброс)",
    "description": "Иногда нужно полностью сбросить ветку к предыдущему коммиту, удалив все изменения как из индекса, так и из рабочего каталога. Это разрушительная операция, которая безвозвратно удаляет незакоммиченные изменения.\n\nУ вас есть коммиты с багами, и вы хотите полностью сброситься к коммиту 'abc123def', удалив все последующие изменения. Используйте жёсткий сброс для этого.",
    "difficulty": "Средне",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git reset --hard <commit-id>', чтобы сброситься к указанному коммиту и удалить все изменения.",
      "Можно использовать идентификатор коммита 'abc123def' или найти его через 'git log'.",
      "Жёсткий сброс является разрушительным — он безвозвратно удалит все незакоммиченные изменения.",
      "Будьте осторожны с жёстким сбросом, так как его сложно отменить."
    ]
  },
  {
    "id": 40,
    "title": "Восстановить удалённый файл из предыдущего коммита",
    "description": "Иногда вы случайно удаляете файл и коммитите удаление, но позже понимаете, что файл нужен. Git позволяет восстановить файлы из предыдущих коммитов, не затрагивая другие изменения.\n\nФайл 'important-config.txt' был удалён в недавнем коммите. Восстановите этот файл из коммита до удаления (ID коммита 'def456abc').",
    "difficulty": "Средне",
    "category": "Отмена и исправление ошибок",
    "hints": [
      "Используйте 'git checkout <commit-id> -- <filename>', чтобы восстановить файл из конкретного коммита.",
      "Также можно использовать 'git restore --source=<commit-id> <filename>' (Git 2.23+).",
      "Коммит 'def456abc' содержит нужную версию файла.",
      "После восстановления файл будет проиндексирован и готов к коммиту."
    ]
  }
]