[
  {
    "id": 41,
    "title": "Начать интерактивное перебазирование для трёх последних коммитов",
    "description": "Интерактивное перебазирование позволяет изменять историю коммитов: менять порядок, редактировать, объединять (squash) или удалять коммиты. Это полезно для приведения истории к порядку перед отправкой в общий репозиторий.\n\nУ вас есть несколько коммитов, которые нужно упорядочить. Запустите интерактивное перебазирование для трёх последних коммитов (HEAD~3), чтобы подготовить их к редактированию.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase -i HEAD~3', чтобы начать интерактивное перебазирование для последних 3 коммитов.",
      "Флаг -i означает 'interactive' и откроет редактор с инструкциями по коммитам.",
      "HEAD~3 означает 'перейти на 3 коммита назад от текущего HEAD'.",
      "Интерактивное перебазирование позволяет pick, reword, edit, squash или drop коммиты."
    ]
  },
  {
    "id": 42,
    "title": "Объединить два коммита в один",
    "description": "Иногда несколько мелких коммитов лучше объединить в один более содержательный. Git позволяет объединять коммиты с помощью интерактивного перебазирования или через сброс и повторный коммит.\n\nУ вас есть два недавних коммита, которые нужно объединить. Используйте интерактивное перебазирование или reset/commit, чтобы выполнить squash.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase -i HEAD~2', чтобы начать интерактивное перебазирование последних 2 коммитов.",
      "Откроется текстовый редактор со списком действий для перебазирования.",
      "Замените вторую строку с 'pick' на 'squash' (или 's'), затем сохраните и закройте редактор.",
      "Если редактор не открылся, используйте запасной вариант: 'git rebase pick squash'",
      "Либо используйте 'git reset --soft HEAD~2', затем 'git commit'."
    ]
  },
  {
    "id": 43,
    "title": "Изменить сообщение старого коммита",
    "description": "Один из ранних коммитов имеет расплывчатое сообщение 'Update file.txt content', которое не описывает, что именно было изменено. Используйте интерактивное перебазирование, чтобы переформулировать это сообщение более информативно.\n\nИспользуйте интерактивное перебазирование, чтобы изменить сообщение второго коммита на что-то более конкретное.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase -i HEAD~2', чтобы начать интерактивное перебазирование последних 2 коммитов.",
      "Замените 'pick' на 'reword' (или 'r') для коммита с сообщением 'Update file.txt content'.",
      "Лучшее сообщение коммита должно описывать, какие именно изменения были внесены в файл.",
      "Сохраните и закройте редактор, затем введите новое сообщение коммита, когда будет предложено."
    ]
  },
  {
    "id": 44,
    "title": "Удалить коммит из истории",
    "description": "Иногда нужно полностью убрать коммит из истории проекта. Это отличается от revert — коммит действительно исчезает, как будто его не было.\n\nУ вас есть коммит с некорректной реализацией, который нужно полностью удалить из истории. Используйте интерактивное перебазирование, чтобы удалить коммит с ID 'abc123def'.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git log --oneline', чтобы увидеть историю и найти проблемный коммит.",
      "Используйте 'git rebase -i HEAD~2', чтобы начать интерактивное перебазирование на 2 коммита назад.",
      "Замените 'pick' на 'drop' (или 'd') для коммита с сообщением 'Add buggy feature'.",
      "Коммит будет полностью удалён из истории, а не просто отменён.",
      "При необходимости используйте 'git rebase --continue' для завершения перебазирования."
    ]
  },
  {
    "id": 45,
    "title": "Переупорядочить коммиты во время интерактивного перебазирования",
    "description": "Иногда нужно реорганизовать историю коммитов, чтобы сделать её более логичной. Судя по истории, 'Update to version 2.0' произошёл до 'Add configuration file', но логичнее сначала добавить конфигурацию, а затем обновлять версии.\n\nИспользуйте интерактивное перебазирование, чтобы переупорядочить последние 3 коммита так, чтобы 'Add configuration file' шёл раньше 'Update to version 2.0'.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase -i HEAD~3', чтобы начать интерактивное перебазирование последних 3 коммитов.",
      "В редакторе перебазирования коммиты перечислены от старых к новым.",
      "Переместите строку 'Add configuration file' выше строки 'Update to version 2.0'.",
      "Сохраните и закройте редактор, чтобы применить новый порядок.",
      "Используйте 'git log --oneline', чтобы убедиться, что порядок стал логичным."
    ]
  },
  {
    "id": 46,
    "title": "Отменить выполняющееся перебазирование",
    "description": "Иногда во время перебазирования возникают конфликты, или вы понимаете, что хотите полностью отменить операцию. Git позволяет прервать текущий процесс перебазирования и вернуть репозиторий в исходное состояние.\n\nВы начали перебазирование, которое столкнулось с конфликтами. Вместо их разрешения отмените перебазирование, чтобы вернуться к исходному состоянию.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase --abort', чтобы отменить выполняющееся перебазирование.",
      "Репозиторий вернётся к состоянию, в котором он был до начала перебазирования.",
      "Любые индексации и метки конфликтов будут автоматически очищены."
    ]
  },
  {
    "id": 47,
    "title": "Продолжить перебазирование после разрешения конфликтов",
    "description": "При перебазировании могут возникать конфликты, если одни и те же строки были изменены в разных коммитах. Git приостанавливает процесс, чтобы вы смогли вручную разрешить конфликты, а затем продолжить.\n\nВы начали перебазирование, которое столкнулось с конфликтами. Разрешите конфликты в затронутых файлах и продолжите процесс перебазирования.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Сначала проверьте статус с помощью 'git status', чтобы увидеть файлы с конфликтами.",
      "Отредактируйте проблемный файл, чтобы убрать метки конфликтов (<<<<<<, ======, >>>>>>).",
      "Проиндексируйте исправленный файл командой 'git add <filename>'.",
      "Продолжите перебазирование командой 'git rebase --continue'."
    ]
  },
  {
    "id": 48,
    "title": "Пропустить коммит во время интерактивного перебазирования",
    "description": "Иногда при перебазировании встречается коммит, который вызывает трудные для разрешения конфликты или проблемы. Git позволяет полностью пропустить проблемный коммит с помощью флага --skip.\n\nВы начали перебазирование и столкнулись с проблемным коммитом. Пропустите текущий коммит и продолжите перебазирование.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git rebase --skip', чтобы пропустить текущий проблемный коммит.",
      "Это отбросит проблемный коммит и продолжит оставшуюся часть перебазирования.",
      "После пропуска перебазирование должно завершиться автоматически."
    ]
  },
  {
    "id": 49,
    "title": "Найти автора каждой строки в файле",
    "description": "Иногда нужно узнать, кто написал каждую строку файла и когда она в последний раз изменялась. Команда git blame показывает пометку авторства по строкам для файла.\n\nИспользуйте git blame, чтобы увидеть информацию об авторстве для файла 'README.md'.",
    "difficulty": "Легко",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git blame <filename>', чтобы увидеть пометку авторства по строкам.",
      "Команда blame показывает хеш коммита, автора, временную метку и номер строки для каждой строки.",
      "Попробуйте 'git blame README.md', чтобы увидеть, кто написал каждую строку файла README."
    ]
  },
  {
    "id": 50,
    "title": "Найти коммит, который внёс определённое изменение",
    "description": "Иногда нужно узнать, когда в кодовую базу было добавлено конкретное изменение или текст. Git предоставляет мощные инструменты поиска, чтобы найти коммиты, которые добавили или удалили определённый контент.\n\nФункция 'authenticateUser' была добавлена в какой-то момент. Используйте инструмент pickaxe в Git, чтобы найти коммит, который ввёл эту функцию.",
    "difficulty": "Средне",
    "category": "Перебазирование и история",
    "hints": [
      "Используйте 'git log -S \"authenticateUser\"', чтобы найти коммиты, которые добавили или удалили функцию authenticateUser.",
      "Флаг -S (pickaxe) ищет коммиты, в которых изменилось число вхождений искомой строки.",
      "Также можно использовать 'git log -G \"pattern\"', чтобы искать коммиты, добавившие или удалившие строки, соответствующие regex-шаблону."
    ]
  }
]