[
	{
		"id": 21,
		"title": "Додати віддалений репозиторій",
		"description": "Віддалені репозиторії дозволяють співпрацювати з іншими та створювати резервні копії вашої роботи.\n\nДодайте віддалений репозиторій з назвою 'origin' та URL:\nhttps://github.com/example/my-project.git",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git remote add origin https://github.com/example/my-project.git', щоб додати віддалений репозиторій.",
			"Ви можете перевірити, що віддалений репозиторій додано, командою 'git remote -v' для показу всіх віддалених репозиторіїв."
		]
	},
	{
		"id": 22,
		"title": "Показати віддалені гілки",
		"description": "Під час роботи з віддаленими репозиторіями часто потрібно бачити, які гілки існують на віддаленому сервері.\n\nВикористайте відповідну команду Git, щоб показати всі віддалені гілки.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git branch -r', щоб показати віддалені гілки.",
			"Ви також можете використовувати 'git branch --remotes' для того самого результату."
		]
	},
	{
		"id": 23,
		"title": "Завантажити останні зміни з віддаленого репозиторія",
		"description": "Завантаження отримує зміни з віддаленого репозиторія без злиття їх у вашу поточну гілку.\n\nВикористайте відповідну команду Git, щоб завантажити останні зміни з віддаленого репозиторія 'origin'.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git fetch', щоб завантажити зміни з віддаленого репозиторія.",
			"Ви можете вказати назву віддаленого репозиторія командою 'git fetch origin' або просто використовувати 'git fetch' для віддаленого репозиторія за замовчуванням."
		]
	},
	{
		"id": 24,
		"title": "Отримати останні зміни з віддаленого репозиторія",
		"description": "Отримання об'єднує завантаження та злиття в одній команді. Воно завантажує останні зміни з віддаленого репозиторія та зливає їх у вашу поточну гілку.\n\nВикористайте відповідну команду Git, щоб отримати останні зміни з віддаленого репозиторія у вашу поточну гілку.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git pull', щоб завантажити та злити зміни з віддаленого репозиторія.",
			"Ви можете вказати назву віддаленого репозиторія командою 'git pull origin' або просто використовувати 'git pull' для віддаленого репозиторія за замовчуванням."
		]
	},
	{
		"id": 25,
		"title": "Відправити вашу локальну гілку до віддаленого репозиторія",
		"description": "Відправлення завантажує ваші локальні коміти до віддаленого репозиторія, роблячи їх доступними для інших співробітників.\n\nУ вас є локальні коміти, якими потрібно поділитися. Відправте вашу поточну гілку до віддаленого репозиторія.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git push', щоб завантажити ваші локальні коміти до віддаленого репозиторія.",
			"Ви можете вказати назву віддаленого репозиторія командою 'git push origin' або використовувати 'git push' для віддаленого репозиторія за замовчуванням.",
			"Якщо це перше відправлення нової гілки, вам може знадобитися 'git push -u origin <назва-гілки>'"
		]
	},
	{
		"id": 26,
		"title": "Відправити нову гілку до віддаленого репозиторія та встановити upstream",
		"description": "Коли ви створюєте нову гілку локально, ви часто хочете відправити її до віддаленого репозиторія та встановити як upstream гілку для зручних майбутніх відправлень та отримань.\n\nСпочатку створіть нову гілку з назвою 'feature-login', потім відправте її до віддаленого репозиторія та встановіть як upstream гілку однією командою.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Спочатку створіть та переключіться на нову гілку командою 'git checkout -b feature-login'",
			"Використайте 'git push -u origin feature-login', щоб відправити гілку та встановити upstream однією командою",
			"Прапорець -u є скороченням від --set-upstream і створює відстежувальний зв'язок"
		]
	},
	{
		"id": 27,
		"title": "Переглянути інформацію про ваші віддалені репозиторії",
		"description": "Іноді потрібно побачити детальну інформацію про ваші віддалені репозиторії, включаючи їх URL та конфігурації fetch/push.\n\nПерегляньте детальну інформацію про ваші віддалені репозиторії за допомогою відповідної команди Git.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git remote -v', щоб побачити назви віддалених репозиторіїв з їх URL.",
			"Ви також можете використовувати 'git remote show <назва-віддаленого>' для перегляду детальної інформації про конкретний віддалений репозиторій."
		]
	},
	{
		"id": 28,
		"title": "Видалити віддалений репозиторій",
		"description": "Іноді потрібно видалити віддалені репозиторії, які більше не потрібні або змінили розташування.\n\nВидаліть віддалений репозиторій 'upstream' з вашого локального репозиторія.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git remote remove upstream', щоб видалити віддалений репозиторій upstream.",
			"Ви також можете використовувати 'git remote rm upstream' як скорочення.",
			"Перевірте, що віддалений репозиторій видалено, командою 'git remote -v' для показу залишених віддалених репозиторіїв."
		]
	},
	{
		"id": 29,
		"title": "Перейменувати віддалений репозиторій",
		"description": "Іноді потрібно перейменувати віддалені репозиторії, щоб краще відобразити їх призначення або дотримуватися конвенцій іменування.\n\nПерейменуйте віддалений репозиторій 'upstream' на 'fork', щоб краще вказати, що це форк оригінального репозиторія.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git remote rename upstream fork', щоб перейменувати віддалений репозиторій.",
			"Ви можете перевірити успішність перейменування командою 'git remote -v' для показу всіх віддалених репозиторіїв.",
			"Перейменування віддаленого репозиторія також автоматично оновлює будь-які гілки відстеження віддалених репозиторіїв."
		]
	},
	{
		"id": 30,
		"title": "Клонувати репозиторій у конкретну директорію",
		"description": "Під час клонування репозиторія ви можете вказати назву директорії, куди його слід клонувати.\n\nКлонуйте репозиторій 'https://github.com/example/my-awesome-project.git' у директорію з назвою 'my-project'.",
		"difficulty": "Легко",
		"category": "Віддалені репозиторії",
		"hints": [
			"Використайте 'git clone <url> <назва-директорії>', щоб клонувати у конкретну директорію.",
			"Синтаксис: git clone https://github.com/example/my-awesome-project.git my-project",
			"Це створить директорію з назвою 'my-project' замість 'my-awesome-project'."
		]
	}
]