[
	{
		"id": 41,
		"title": "Почати інтерактивний перебазис для останніх трьох комітів",
		"description": "Інтерактивний перебазис дозволяє модифікувати історію комітів шляхом переупорядкування, редагування, об'єднання або видалення комітів. Це корисно для очищення історії комітів перед відправленням до спільного репозиторія.\n\nУ вас є кілька комітів, які потребують очищення. Почніть інтерактивний перебазис для останніх трьох комітів (HEAD~3), щоб підготувати їх до редагування.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase -i HEAD~3', щоб почати інтерактивний перебазис для останніх 3 комітів.",
			"Прапорець -i означає 'інтерактивний' і відкриє редактор з інструкціями комітів.",
			"HEAD~3 означає 'повернутися на 3 коміти назад від поточного HEAD'.",
			"Інтерактивний перебазис дозволяє вибирати, переформулювати, редагувати, об'єднувати або видаляти коміти."
		]
	},
	{
		"id": 42,
		"title": "Об'єднати два коміти в один",
		"description": "Іноді у вас є кілька невеликих комітів, які краще об'єднати в один, більш змістовний коміт. Git дозволяє об'єднувати коміти разом за допомогою інтерактивного перебазису або скидання та повторної фіксації.\n\nУ вас є два останні коміти, які слід об'єднати в один. Використайте інтерактивний перебазис або reset/commit, щоб об'єднати їх разом.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase -i HEAD~2', щоб почати інтерактивний перебазис останніх 2 комітів.",
			"Це відкриє текстовий редактор зі списком завдань перебазису.",
			"Змініть другий рядок з 'pick' на 'squash' (або 's'), потім збережіть і закрийте редактор.",
			"Якщо редактор не відкривається, використайте резервний варіант: 'git rebase pick squash'",
			"Альтернативно, використайте 'git reset --soft HEAD~2', а потім 'git commit'."
		]
	},
	{
		"id": 43,
		"title": "Переформулювати повідомлення старого коміту",
		"description": "Один з попередніх комітів має неясне повідомлення 'Update file.txt content', яке не описує, що насправді було змінено. Використайте інтерактивний перебазис, щоб переформулювати це повідомлення коміту, зробивши його більш описовим.\n\nВикористайте інтерактивний перебазис, щоб переформулювати повідомлення другого коміту на щось більш конкретне.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase -i HEAD~2', щоб почати інтерактивний перебазис останніх 2 комітів.",
			"Змініть 'pick' на 'reword' (або 'r') для коміту з повідомленням 'Update file.txt content'.",
			"Краще повідомлення коміту може описувати, які конкретні зміни були внесені до файлу.",
			"Збережіть і закрийте редактор, потім надайте нове повідомлення коміту при запиті."
		]
	},
	{
		"id": 44,
		"title": "Видалити коміт з історії",
		"description": "Іноді потрібно повністю видалити коміт з історії вашого проєкту. Це відрізняється від відвертання — це фактично видаляє коміт, ніби його ніколи не існувало.\n\nУ вас є коміт з поганою реалізацією, який потрібно повністю видалити з історії. Використайте інтерактивний перебазис, щоб відкинути коміт з ID 'abc123def'.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git log --oneline', щоб побачити історію комітів та ідентифікувати помилковий коміт.",
			"Використайте 'git rebase -i HEAD~2', щоб почати інтерактивний перебазис, повертаючись на 2 коміти назад.",
			"Змініть 'pick' на 'drop' (або 'd') для коміту з повідомленням 'Add buggy feature'.",
			"Коміт буде повністю видалений з історії, а не просто відвернений.",
			"Використайте 'git rebase --continue' за потреби, щоб завершити перебазис."
		]
	},
	{
		"id": 45,
		"title": "Переупорядкувати коміти під час інтерактивного перебазису",
		"description": "Іноді потрібно реорганізувати вашу історію комітів, щоб зробити її більш логічною. Дивлячись на історію комітів, 'Update to version 2.0' сталося перед 'Add configuration file', але логічно ви б хотіли додати конфігурацію перед оновленням версій.\n\nВикористайте інтерактивний перебазис, щоб переупорядкувати останні 3 коміти так, щоб 'Add configuration file' йшов хронологічно перед 'Update to version 2.0'.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase -i HEAD~3', щоб почати інтерактивний перебазис останніх 3 комітів.",
			"У редакторі перебазису ви побачите коміти, перелічені від найстарішого до найновішого.",
			"Перемістіть рядок 'Add configuration file', щоб він йшов перед рядком 'Update to version 2.0'.",
			"Збережіть і закрийте редактор, щоб застосувати новий порядок комітів.",
			"Використайте 'git log --oneline', щоб перевірити, що коміти тепер у логічному порядку."
		]
	},
	{
		"id": 46,
		"title": "Перервати поточний перебазис",
		"description": "Іноді під час операції перебазису ви стикаєтеся з конфліктами або розумієте, що хочете повністю скасувати перебазис. Git дозволяє перервати поточний перебазис і повернути ваш репозиторій до стану до перебазису.\n\nВи почали перебазис, який зіткнувся з конфліктами. Замість їх вирішення, перервіть перебазис, щоб повернутися до початкового стану.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase --abort', щоб скасувати поточну операцію перебазису.",
			"Це поверне ваш репозиторій до точного стану, в якому він був перед початком перебазису.",
			"Будь-які проіндексовані зміни або маркери конфліктів будуть автоматично очищені."
		]
	},
	{
		"id": 47,
		"title": "Продовжити перебазис після вирішення конфліктів",
		"description": "Під час перебазису комітів можуть виникати конфлікти, якщо одні й ті самі рядки були змінені в різних комітах. Git призупинить перебазис і дозволить вам вручну вирішити конфлікти перед продовженням.\n\nВи почали перебазис, який зіткнувся з конфліктами. Вирішіть конфлікти в затронутих файлах і продовжте процес перебазису.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Спочатку перевірте стан командою 'git status', щоб побачити, які файли мають конфлікти.",
			"Відредагуйте конфліктний файл, щоб вирішити маркери конфліктів (<<<<<<, ======, >>>>>>).",
			"Проіндексуйте вирішений файл командою 'git add <filename>'.",
			"Продовжте перебазис командою 'git rebase --continue'."
		]
	},
	{
		"id": 48,
		"title": "Пропустити коміт під час інтерактивного перебазису",
		"description": "Іноді під час перебазису ви стикаєтеся з комітом, який спричиняє конфлікти або проблеми, які важко вирішити. Git дозволяє повністю пропустити проблемні коміти за допомогою прапорця --skip.\n\nВи почали перебазис, який зіткнувся з проблемним комітом. Пропустіть поточний коміт і продовжте з перебазисом.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git rebase --skip', щоб пропустити поточний проблемний коміт.",
			"Це відкине проблемний коміт і продовжить з решти комітів.",
			"Перебазис повинен завершитися автоматично після пропуску проблемного коміту."
		]
	},
	{
		"id": 49,
		"title": "Знайти автора кожного рядка у файлі",
		"description": "Іноді потрібно побачити, хто написав кожен рядок файлу і коли він був останній раз змінений. Команда git blame показує інформацію про авторство рядок за рядком для файлу.\n\nВикористайте git blame, щоб побачити інформацію про авторство файлу 'README.md'.",
		"difficulty": "Легко",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git blame <filename>', щоб побачити інформацію про авторство рядок за рядком.",
			"Команда blame показує хеш коміту, автора, часову мітку та номер рядка для кожного рядка.",
			"Спробуйте 'git blame README.md', щоб побачити, хто написав кожен рядок файлу README."
		]
	},
	{
		"id": 50,
		"title": "Знайти коміт, який ввів конкретну зміну",
		"description": "Іноді потрібно знайти, коли конкретний фрагмент коду або тексту був доданий до вашої кодової бази. Git надає потужні можливості пошуку, щоб допомогти вам знайти коміти, які додали або видалили конкретний вміст.\n\nФункція з назвою 'authenticateUser' була додана до кодової бази в якийсь момент. Використайте функцію pickaxe Git, щоб знайти коміт, який ввів цю функцію.",
		"difficulty": "Середньо",
		"category": "Перебазис та історія",
		"hints": [
			"Використайте 'git log -S \"authenticateUser\"', щоб знайти коміти, які додали або видалили функцію authenticateUser.",
			"Прапорець -S (pickaxe) шукає коміти, де змінилася кількість входжень рядка пошуку.",
			"Ви також можете використовувати 'git log -G \"pattern\"', щоб шукати коміти, які додали або видалили рядки, що відповідають регексу."
		]
	}
]