[
	{
		"id": 51,
		"title": "Приховати незафіксовані зміни",
		"description": "Іноді ви працюєте над чимось, але потрібно швидко переключити контекст або отримати зміни з віддаленого репозиторія. Git stash дозволяє тимчасово зберігати ваші незафіксовані зміни без створення коміту.\n\nУ вас є незафіксовані зміни у вашому робочому каталозі. Використайте git stash, щоб зберегти ці зміни, щоб ви могли працювати над чимось іншим і повернутися до них пізніше.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash' або 'git stash push', щоб зберегти ваші незафіксовані зміни.",
			"Після приховування ваш робочий каталог повинен бути чистим.",
			"Ви можете пізніше отримати ваші зміни командою 'git stash pop' або 'git stash apply'."
		]
	},
	{
		"id": 52,
		"title": "Переглянути список всіх прихованих змін",
		"description": "Git дозволяє переглядати всі ваші приховані зміни за допомогою команди stash list. Це показує всі схови, які ви зберегли, разом з їх повідомленнями та ID схову.\n\nУ вас є існуючі приховані зміни. Використайте Git, щоб переглянути список всіх ваших прихованих змін.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash list', щоб переглянути всі ваші приховані зміни.",
			"Кожний запис схову показує ID схову (stash@{0}, stash@{1}, тощо) та повідомлення схову.",
			"Найновіший схов знаходиться вгорі списку (stash@{0})."
		]
	},
	{
		"id": 53,
		"title": "Застосувати останній схов без його видалення",
		"description": "Іноді ви хочете застосувати приховані зміни до вашого робочого каталогу, але зберегти запис схову для потенційного майбутнього використання. Команда 'git stash apply' застосовує схов без видалення його зі списку схову, на відміну від 'git stash pop', яка його видаляє.\n\nУ вас є приховані зміни, які ви хочете застосувати до вашого робочого каталогу, але ви хочете зберегти запис схову на випадок, якщо він знадобиться пізніше.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash apply', щоб застосувати останній схов без видалення його зі списку схову.",
			"На відміну від 'git stash pop', 'git stash apply' зберігає запис схову для майбутнього використання.",
			"Ви можете перевірити, що схов все ще там, командою 'git stash list' після застосування."
		]
	},
	{
		"id": 54,
		"title": "Застосувати конкретний схов",
		"description": "Коли у вас є кілька схов, ви можете застосувати конкретний, посилаючись на його індекс. Кожен схов пронумерований, починаючи з 0, де stash@{0} — найновіший, stash@{1} — другий за новизною, і так далі.\n\nУ вас є кілька прихованих змін. Застосуйте другий запис схову (stash@{1}) без видалення його зі списку схову.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash list', щоб побачити всі доступні записи схову.",
			"Використайте 'git stash apply stash@{1}', щоб застосувати другий запис схову.",
			"Ви також можете використовувати коротку форму 'git stash apply 1'.",
			"Запис stash@{1} повинен залишитися у списку схову після застосування."
		]
	},
	{
		"id": 55,
		"title": "Видалити конкретний схов",
		"description": "Іноді ви хочете видалити конкретний запис схову без його застосування. Команда 'git stash drop' може націлюватися на конкретний схов за його посиланням (stash@{1}, stash@{2}, тощо).\n\nУ вас є кілька прихованих змін. Видаліть другий запис схову (stash@{1}) без його застосування.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash list', щоб побачити всі доступні записи схову.",
			"Використайте 'git stash drop stash@{1}', щоб видалити другий запис схову.",
			"Ви також можете використовувати коротку форму 'git stash drop 1'.",
			"Запис stash@{1} повинен бути видалений зі списку схову після відкидання."
		]
	},
	{
		"id": 56,
		"title": "Створити схов з користувацьким повідомленням",
		"description": "Під час приховування змін ви можете надати користувацьке повідомлення, щоб допомогти ідентифікувати, що містить схов. Це особливо корисно, коли у вас є кілька схов і потрібно пам'ятати, для чого був кожен з них.\n\nУ вас є незафіксовані зміни у вашому робочому каталозі. Створіть схов з користувацьким повідомленням 'Work in progress on feature X'.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash push -m \"message\"', щоб створити схов з користувацьким повідомленням.",
			"Ви також можете використовувати 'git stash save \"message\"' (застаріле, але все ще працює).",
			"Повідомлення повинно бути: 'Work in progress on feature X'",
			"Після приховування ваш робочий каталог повинен бути чистим."
		]
	},
	{
		"id": 57,
		"title": "Приховати також невідстежувані файли",
		"description": "За замовчуванням git stash зберігає лише відстежувані файли, які були змінені. Іноді ви також хочете приховати невідстежувані файли (файли, які ще не були додані до Git). Використайте прапорець --include-untracked, щоб приховати як відстежувані, так і невідстежувані файли.\n\nУ вас є змінені відстежувані файли та нові невідстежувані файли. Приховайте всі з них, включаючи невідстежувані файли.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash -u' або 'git stash --include-untracked', щоб приховати також невідстежувані файли.",
			"Ви також можете використовувати 'git stash push -u' з тим самим ефектом.",
			"Після приховування як відстежувані, так і невідстежувані файли повинні бути збережені, а ваш робочий каталог повинен бути повністю чистим."
		]
	},
	{
		"id": 58,
		"title": "Витягнути останній схов і видалити його",
		"description": "Команда 'git stash pop' застосовує найновіший схов до вашого робочого каталогу та видаляє його зі списку схову. Це відрізняється від 'git stash apply', яка зберігає запис схову після застосування.\n\nУ вас є приховані зміни, які ви хочете застосувати до вашого робочого каталогу та видалити зі списку схову назавжди.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash pop', щоб застосувати останній схов і видалити його зі списку схову.",
			"На відміну від 'git stash apply', 'git stash pop' видаляє запис схову після його застосування.",
			"Ви можете перевірити, що схов було видалено, командою 'git stash list' після витягування."
		]
	},
	{
		"id": 59,
		"title": "Витягнути конкретний схов",
		"description": "Коли у вас є кілька схов, ви можете витягнути конкретний, посилаючись на його індекс. Команда 'git stash pop' з посиланням на схов застосовує схов і видаляє його зі списку схову.\n\nУ вас є кілька прихованих змін. Витягніть другий запис схову (stash@{1}) і видаліть його зі списку схову.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash list', щоб побачити всі доступні записи схову.",
			"Використайте 'git stash pop stash@{1}', щоб витягнути другий запис схову.",
			"Ви також можете використовувати коротку форму 'git stash pop 1'.",
			"Запис stash@{1} повинен бути видалений зі списку схову після витягування."
		]
	},
	{
		"id": 60,
		"title": "Очистити всі приховані зміни",
		"description": "Іноді ви хочете назавжди видалити всі приховані зміни одразу. Команда 'git stash clear' видаляє всі записи схову з вашого списку схову. Будьте обережні з цією командою, оскільки вона назавжди видаляє всі ваші приховані зміни.\n\nУ вас є кілька прихованих змін, які вам більше не потрібні. Очистіть всі записи схову, щоб очистити ваш список схову.",
		"difficulty": "Легко",
		"category": "Приховування",
		"hints": [
			"Використайте 'git stash clear', щоб видалити всі записи схову одразу.",
			"Ця команда назавжди видаляє всі приховані зміни — використовуйте з обережністю.",
			"Ви можете перевірити, що всі схови були очищені, командою 'git stash list' після цього."
		]
	}
]