[
	{
		"id": 31,
		"title": "Виправити останній коміт без зміни повідомлення",
		"description": "Іноді ви розумієте, що забули проіндексувати файл або зробили невелику зміну після коміту. Git дозволяє виправити останній коміт, щоб включити додаткові зміни без створення нового коміту.\n\nУ вас є проіндексовані зміни, які мали бути включені в останній коміт. Виправте останній коміт, щоб включити ці зміни без зміни повідомлення коміту.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git commit --amend --no-edit', щоб виправити останній коміт без зміни повідомлення.",
			"Прапорець --amend змінює останній коміт замість створення нового.",
			"Прапорець --no-edit зберігає існуюче повідомлення коміту незмінним."
		]
	},
	{
		"id": 32,
		"title": "Виправити останній коміт та оновити його повідомлення",
		"description": "Іноді потрібно змінити повідомлення останнього коміту або додати до нього забуті зміни.\n\nВаш останній коміт має повідомлення 'Add new feature', але повинен мати 'Add user authentication feature'. Використайте функціонал виправлення Git, щоб оновити повідомлення коміту.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git commit --amend -m \"Add user authentication feature\"', щоб змінити повідомлення останнього коміту.",
			"Прапорець --amend змінює найновіший коміт замість створення нового.",
			"Не використовуйте --no-edit, оскільки це збереже існуюче (неправильне) повідомлення."
		]
	},
	{
		"id": 33,
		"title": "Скасувати останній коміт, але зберегти зміни проіндексованими",
		"description": "Іноді ви робите коміт занадто рано і розумієте, що хочете внести додаткові зміни або виправити повідомлення коміту. Git дозволяє скасувати останній коміт, зберігаючи зміни проіндексованими, щоб ви могли їх змінити та знову зафіксувати.\n\nВаш останній коміт був зроблений передчасно. Скасуйте його, але збережіть зміни проіндексованими, щоб ви могли далі працювати з ними.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git reset --soft HEAD~1', щоб скасувати останній коміт, але зберегти зміни проіндексованими.",
			"Прапорець --soft зберігає ваші проіндексовані зміни, на відміну від --hard, який їх відкидає.",
			"HEAD~1 посилається на коміт перед поточним HEAD (один коміт назад)."
		]
	},
	{
		"id": 34,
		"title": "Скасувати останній коміт та деіндексувати зміни",
		"description": "Іноді ви хочете скасувати коміт, але зберегти зміни у вашому робочому каталозі як непроіндексовані файли. Це дозволяє далі змінювати файли перед повторним комітом.\n\nВаш останній коміт потрібно скасувати, а зміни повинні залишитися у вашому робочому каталозі, але бути деіндексованими.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git reset HEAD~1', щоб скасувати останній коміт та деіндексувати зміни.",
			"Змішаний скид (за замовчуванням) переміщує HEAD назад та деіндексує файли, але зберігає зміни в робочому каталозі.",
			"HEAD~1 посилається на коміт перед поточним HEAD (один коміт назад)."
		]
	},
	{
		"id": 35,
		"title": "Деіндексувати файл, який був доданий випадково",
		"description": "Іноді ви випадково індексуєте файл, який не збираєтеся включати в наступний коміт. Git дозволяє деіндексувати файли без втрати змін у вашому робочому каталозі.\n\nВи випадково проіндексували 'temp.log', який не повинен бути зафіксований. Деіндексуйте цей файл, зберігши зміни в робочому каталозі.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git reset HEAD temp.log', щоб деіндексувати файл, зберігши зміни в робочому каталозі.",
			"Ви також можете використовувати 'git reset temp.log' як скорочення для тієї самої операції.",
			"Файл залишиться зміненим у вашому робочому каталозі після деіндексації."
		]
	},
	{
		"id": 36,
		"title": "Відкинути незафіксовані зміни до файлу",
		"description": "Іноді ви вносите зміни до файлу, але розумієте, що хочете їх відкинути та повернути файл до його останнього зафіксованого стану. Git дозволяє відкидати зміни у вашому робочому каталозі без впливу на проіндексовані зміни.\n\nВи внесли зміни до 'file.txt', які хочете відкинути. Використайте Git, щоб відновити файл до його останнього зафіксованого стану.",
		"difficulty": "Легко",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git checkout -- file.txt', щоб відкинути зміни до файлу.",
			"Ви також можете використовувати 'git restore file.txt' (Git 2.23+) для того самого ефекту.",
			"Це впливає лише на незафіксовані зміни у вашому робочому каталозі, не на проіндексовані зміни."
		]
	},
	{
		"id": 37,
		"title": "Відвернути коміт, який був відправлений до віддаленого репозиторія",
		"description": "Іноді потрібно скасувати зміни з коміту, який уже був відправлений до віддаленого репозиторія. На відміну від git reset, git revert створює новий коміт, який скасовує зміни, роблячи це безпечним для спільних репозиторіїв.\n\nУ вас є коміт з ID 'abc123def', який ввів помилку і потребує відвертання. Використайте git revert, щоб безпечно скасувати його зміни.",
		"difficulty": "Середньо",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git revert <commit-id>', щоб створити новий коміт, який скасовує зміни з вказаного коміту.",
			"git revert безпечніший за git reset для комітів, які були відправлені до віддалених репозиторіїв.",
			"Команда revert відкриє редактор для повідомлення коміту, або використайте -m, щоб вказати його безпосередньо."
		]
	},
	{
		"id": 38,
		"title": "Скинути гілку до попереднього коміту (м'який скид)",
		"description": "Іноді потрібно скинути вашу гілку до попереднього коміту, зберігши ваші зміни в області індексації. Це дозволяє повторно зафіксувати зміни з іншою структурою або повідомленням.\n\nУ вас є коміти, які потрібно скасувати, але ви хочете зберегти зміни проіндексованими. Скиньте вашу гілку до коміту 'abc123def', використавши м'який скид.",
		"difficulty": "Середньо",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git reset --soft <commit-id>', щоб скинути до конкретного коміту, зберігши зміни проіндексованими.",
			"Ви можете використовувати ID коміту 'abc123def' або знайти його за допомогою 'git log'.",
			"М'який скид переміщує HEAD назад, але зберігає вашу область індексації та робочий каталог."
		]
	},
	{
		"id": 39,
		"title": "Скинути гілку до попереднього коміту (жорсткий скид)",
		"description": "Іноді потрібно повністю скинути вашу гілку до попереднього коміту, відкинувши всі зміни як в області індексації, так і в робочому каталозі. Це деструктивна операція, яка назавжди видаляє незафіксовані зміни.\n\nУ вас є коміти, які містять помилки, і ви хочете повністю скинутися до коміту 'abc123def', відкинувши всі наступні зміни. Використайте жорсткий скид для досягнення цього.",
		"difficulty": "Середньо",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git reset --hard <commit-id>', щоб скинути до конкретного коміту та відкинути всі зміни.",
			"Ви можете використовувати ID коміту 'abc123def' або знайти його за допомогою 'git log'.",
			"Жорсткий скид деструктивний — він назавжди видалить всі незафіксовані зміни.",
			"Будьте обережні з жорстким скидом, оскільки його неможливо легко скасувати."
		]
	},
	{
		"id": 40,
		"title": "Відновити видалений файл з попереднього коміту",
		"description": "Іноді ви випадково видаляєте файл і фіксуєте видалення, але пізніше розумієте, що цей файл вам потрібен. Git дозволяє відновлювати файли з попередніх комітів без впливу на інші зміни.\n\nФайл з назвою 'important-config.txt' був видалений у недавньому коміті. Відновіть цей файл з коміту перед тим, як його було видалено (ID коміту 'def456abc').",
		"difficulty": "Середньо",
		"category": "Скасування та виправлення помилок",
		"hints": [
			"Використайте 'git checkout <commit-id> -- <filename>', щоб відновити файл з конкретного коміту.",
			"Ви також можете використовувати 'git restore --source=<commit-id> <filename>' (Git 2.23+).",
			"ID коміту 'def456abc' містить версію файлу, яку ви хочете відновити.",
			"Після відновлення файл буде проіндексований і готовий до коміту."
		]
	}
]