[
	{
		"id": 61,
		"title": "Переключитися на попередній коміт без зміни історії",
		"description": "Іноді потрібно дослідити стан вашого коду в конкретній точці історії без створення нової гілки або зміни історії комітів. Git дозволяє переключитися на конкретний коміт безпосередньо, переводячи вас у стан 'відʼєднаного HEAD'.\n\nВи підозрюєте, що коміт 'abc123def' ввів помилку. Переключіться на цей конкретний коміт, щоб дослідити код у той момент часу.",
		"difficulty": "Середньо",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git checkout <commit-id>', щоб переключитися на конкретний коміт безпосередньо.",
			"Це переведе вас у стан 'відʼєднаного HEAD' — ви не на жодній гілці.",
			"Ви можете використовувати повний ID коміту або лише перші 7 символів: 'abc123d'.",
			"Використайте 'git log', щоб побачити доступні коміти та їх ID."
		]
	},
	{
		"id": 62,
		"title": "Дізнатися, які файли змінилися в конкретному коміті",
		"description": "Іноді потрібно побачити, які файли були змінені в конкретному коміті, не бачачи повного вмісту diff. Git надає опції для показу лише імен файлів, які змінилися.\n\nВикористайте git show, щоб відобразити лише назви файлів, які змінилися в коміті 'abc789def' (коміт реалізації автентифікації).",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git show --name-only <commit-id>', щоб показати лише імена файлів, які змінилися.",
			"Ви також можете використовувати 'git show --name-status <commit-id>', щоб показати імена файлів зі статусом змін.",
			"ID коміту 'abc789def' реалізував систему автентифікації користувача."
		]
	},
	{
		"id": 63,
		"title": "Показати зміни, внесені комітом",
		"description": "Іноді потрібно побачити точно, які зміни були внесені в конкретному коміті. Команда 'git show' відображає інформацію про коміт разом з фактичними змінами (diff), внесеними цим комітом.\n\nВикористайте git show, щоб відобразити зміни, внесені комітом 'abc123def'.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git show <commit-id>', щоб відобразити зміни, внесені конкретним комітом.",
			"Команда git show відображає як метадані коміту, так і фактичний diff.",
			"Ви можете використовувати повний ID коміту або лише перші кілька символів."
		]
	},
	{
		"id": 64,
		"title": "Показати коміти в конкретній гілці, яких немає в main",
		"description": "Під час роботи з кількома гілками ви часто потребуєте побачити, які коміти існують у гілці функціональності, які ще не були злиті в основну гілку. Git надає кілька способів порівняння гілок і показу комітів, які існують в одній гілці, але не в іншій.\n\nУ вас є гілка 'feature', яка містить коміти, яких немає в гілці 'master'. Використайте git log, щоб показати лише коміти, які існують у гілці 'feature', але не в 'master'.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git log master..feature', щоб показати коміти в feature, яких немає в master.",
			"Ви також можете використовувати 'git log feature --not master' для того самого результату.",
			"Синтаксис '..' означає 'коміти, досяжні з правого боку, але не з лівого'.",
			"Додайте '--oneline', щоб побачити більш компактний вигляд комітів."
		]
	},
	{
		"id": 65,
		"title": "Перевірити історію конкретного файлу",
		"description": "Іноді потрібно побачити історію комітів для конкретного файлу, щоб зрозуміти, як він розвивався з часом. Git дозволяє фільтрувати журнал, щоб показати лише коміти, які вплинули на конкретний файл.\n\nВи хочете побачити історію змін файлу 'config.js'. Використайте git log, щоб показати лише коміти, які змінили цей файл.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git log <filename>', щоб показати коміти, які змінили конкретний файл.",
			"Ви також можете використовувати 'git log --follow <filename>', щоб відстежувати файл через перейменування.",
			"Додайте '--oneline', щоб побачити більш компактний вигляд історії файлу."
		]
	},
	{
		"id": 66,
		"title": "Показати різницю між двома комітами",
		"description": "Іноді потрібно побачити, що змінилося між двома конкретними комітами. Git дозволяє порівнювати будь-які два коміти, щоб побачити відмінності в їх вмісті.\n\nВи хочете побачити відмінності між комітом 'abc123def' (помилкова функція) та комітом 'def456abc' (виправлення стилю). Використайте git diff, щоб показати зміни між цими двома комітами.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git diff <commit1> <commit2>', щоб показати відмінності між двома комітами.",
			"Ви також можете використовувати 'git diff <commit1>..<commit2>' для того самого результату.",
			"Порядок має значення — 'git diff A B' показує, що змінилося від A до B.",
			"Використайте 'git log --oneline', щоб побачити доступні коміти та їх ID."
		]
	},
	{
		"id": 67,
		"title": "Порівняти дві гілки та побачити їх відмінності",
		"description": "Під час роботи з кількома гілками ви часто потребуєте побачити, які зміни існують між ними. Git надає кілька способів порівняння гілок і перегляду відмінностей у їх вмісті.\n\nУ вас є гілка 'feature' та гілка 'master'. Використайте git diff, щоб показати відмінності між цими двома гілками.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git diff <branch1> <branch2>', щоб порівняти дві гілки.",
			"Ви також можете використовувати 'git diff <branch1>..<branch2>' для того самого результату.",
			"Порядок має значення — 'git diff A B' показує, що змінилося від A до B.",
			"Використайте 'git branch', щоб побачити доступні гілки."
		]
	},
	{
		"id": 68,
		"title": "Знайти коміти конкретного автора",
		"description": "Іноді потрібно знайти всі коміти, зроблені конкретним автором, щоб відстежити їх внески або переглянути їх роботу. Git дозволяє фільтрувати історію комітів за іменем або електронною поштою автора.\n\nВи хочете побачити всі коміти, зроблені 'John Smith'. Використайте git log, щоб показати лише коміти, автором яких є ця особа.",
		"difficulty": "Легко",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git log --author=\"John Smith\"', щоб показати коміти конкретного автора.",
			"Ви можете використовувати часткове збігання: 'git log --author=john' знайде 'John Smith'.",
			"Збігання автора за замовчуванням нечутливе до регістру.",
			"Ви можете комбінувати --author з іншими прапорцями, такими як --oneline, для компактного виводу."
		]
	},
	{
		"id": 69,
		"title": "Відновити видалену гілку",
		"description": "Іноді ви випадково видаляєте гілку, яка вам все ще потрібна. Git відстежує, куди вказували гілки, навіть після їх видалення через reflog. Ви можете відновити видалену гілку, знайшовши її останній коміт і відтворивши її.\n\nВи випадково видалили гілку 'feature-login'. Використайте git reflog, щоб знайти, куди вона вказувала, і відновіть її.",
		"difficulty": "Середньо",
		"category": "Налагодження",
		"hints": [
			"Використайте 'git reflog', щоб побачити історію переміщень HEAD і знайти, куди вказувала видалена гілка.",
			"Шукайте записи на кшталт 'checkout: moving from feature-login to master', щоб знайти останній коміт гілки.",
			"Використайте 'git checkout -b feature-login <commit-id>', щоб відтворити гілку в цьому коміті.",
			"Ви також можете використовувати 'git branch feature-login <commit-id>', якщо ви не на гілці, яку хочете створити."
		]
	},
	{
		"id": 70,
		"title": "Ідентифікувати коміт, який ввів помилку, за допомогою git bisect",
		"description": "Git bisect — це потужний інструмент для знаходження точного коміту, який ввів помилку, за допомогою бінарного пошуку. Ви починаєте з позначення відомого хорошого коміту та відомого поганого коміту, потім Git проведе вас через тестування комітів, доки не знайде перший поганий коміт.\n\nВи знаєте, що коміт 'abc123def' поганий (містить помилку), а коміт 'xyz789abc' хороший (не містить помилки). Використайте git bisect, щоб ідентифікувати, який коміт ввів помилку.",
		"difficulty": "Важко",
		"category": "Налагодження",
		"hints": [
			"Почніть з 'git bisect start', щоб розпочати процес бісекції.",
			"Використайте 'git bisect bad <commit-id>', щоб позначити відомий поганий коміт.",
			"Використайте 'git bisect good <commit-id>', щоб позначити відомий хороший коміт.",
			"Git переключить коміти для вас для тестування — позначте кожен як 'git bisect good' або 'git bisect bad'.",
			"Продовжуйте, доки Git не ідентифікує перший поганий коміт.",
			"Використайте 'git bisect reset', коли закінчите, щоб повернутися до вашої оригінальної гілки."
		]
	}
]