[
    {
        "id": 41,
        "title": "Покретање интерактивног rebase-овања за последња три commit-а",
        "description": "Интерактивно rebase-овање Вам омогућава да измените историју commit-ова њиховoм изменом, squash-овањем, уклањањем или променом редоследа. Ово је корисно за чишћење историје commit-ова пре push-овања у дељени репозиторијум.\n\nИмате неколико commit-ова које је потребно очистити. Покрените интерактивно rebase-овање за последња три commit-а (HEAD~3) како бисте их припремили за измену.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase -i HEAD~3' да бисте покренули интерактивно rebase-овање за последња 3 commit-а.",
            "Flag -i означава 'interactive' и отвориће едитор са упутствима за commit-ове.",
            "HEAD~3 значи 'врати се 3 commit-а уназад од тренутног HEAD-а'.",
            "Интерактивно rebase-овање Вам омогућава да pick-ујете, мењате, squash-ујете или уклоните commit-ове, као и да им мењате поруку."
        ]
    },
    {
        "id": 42,
        "title": "Squash-овање два commit-а у један",
        "description": "Понекад имате више малих commit-ова које је боље објединити у један, смисленији commit. Git Вам омогућава да squash-ујете commit-ове коришћењем интерактивног rebase-овања или ресетовањем и поновним commit-овањем.\n\nИмате два недавна commit-а која треба објединити у један. Користите или интерактивно rebase-овање или reset/commit да бисте их squash-овали.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase -i HEAD~2' да бисте покренули интерактивно rebase-овање за последња 2 commit-а.",
            "Ово ће отворити текстуални едитор са rebase todo листом.",
            "Промените другу линију из 'pick' у 'squash' (или 's'), затим сачувајте и затворите едитор.",
            "Ако се едитор не отвори, можете користити алтернативу: 'git rebase pick squash'.",
            "Алтернативно, користите 'git reset --soft HEAD~2', а затим 'git commit'."
        ]
    },
    {
        "id": 43,
        "title": "Измена поруке старог commit-а",
        "description": "Један од ранијих commit-ова има нејасну поруку 'Update file.txt content' која не описује шта је заправо измењено. Користите интерактивно rebase-овање да бисте изменили поруку commit-а да боље описује измене.\n\nКористите интерактивно rebase-овање да бисте изменили поруку другог commit-а у нешто конкретније.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase -i HEAD~2' да бисте покренули интерактивно rebase-овање за последња 2 commit-а.",
            "Промените 'pick' у 'reword' (или 'r') за commit са поруком 'Update file.txt content'.",
            "Боља commit порука би требало да описује које су конкретне измене направљене у фајлу.",
            "Сачувајте и затворите едитор, а затим унесите нову commit поруку када будете упитани."
        ]
    },
    {
        "id": 44,
        "title": "Брисање commit-а из историје",
        "description": "Понекад је потребно у потпуности уклонити commit из историје пројекта. Ово се разликује од revert-овања - commit се заиста уклања као да никада није постојао.\n\nИмате commit са лошом имплементацијом којег је потребно у потпуности уклонити из историје. Користите интерактивно rebase-овање да бисте уклонили commit са ID-ем 'abc123def'.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git log --oneline' да бисте видели историју commit-ова и идентификовали проблематичан commit.",
            "Користите 'git rebase -i HEAD~2' да бисте покренули интерактивно rebase-овање два commit-а уназад.",
            "Промените 'pick' у 'drop' (или 'd') за commit са поруком 'Add buggy feature'.",
            "Commit ће бити у потпуности уклоњен из историје, а не само revert-ован.",
            "Користите 'git rebase --continue' ако је потребно да довршите rebase-овање."
        ]
    },
    {
        "id": 45,
        "title": "Промена редоследа commit-ова током интерактивног rebase-овања",
        "description": "Понекад је потребно да реорганизујете историју commit-ова како би била логичнија. У постојећој историји, commit 'Update to version 2.0' се догодио пре commit-а 'Add configuration file', али логично је да се конфигурација дода пре ажурирања верзије.\n\nКористите интерактивно rebase-овање да бисте променили редослед последња 3 commit-а тако да 'Add configuration file' буде хронолошки пре 'Update to version 2.0'.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase -i HEAD~3' да бисте покренули интерактивно rebase-овање за последња 3 commit-а.",
            "У rebase едитору, commit-ови ће бити приказани од најстаријег до најновијег.",
            "Преместите линију 'Add configuration file' пре линије 'Update to version 2.0'.",
            "Сачувајте и затворите едитор да бисте применили нови редослед commit-ова.",
            "Користите 'git log --oneline' да бисте проверили да ли су commit-ови сада логично поређани."
        ]
    },
    {
        "id": 46,
        "title": "Прекидање rebase-овања у току",
        "description": "Понекад током rebase-овања наиђете на конфликте или схватите да желите у потпуности да откажете процес. Git Вам омогућава да прекинете rebase-овање које је у току и вратите репозиторијум у стање пре његовог покретања.\n\nПокренули Сте rebase-овање које је наишло на конфликте. Уместо њиховог решавања, прекините rebase-овање и вратите се у првобитно стање.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase --abort' да бисте отказали rebase-овање које је у току.",
            "Овим ће се репозиторијум вратити у стање у ком је био пре покретања rebase-овања.",
            "Све stage-оване измене и маркери конфликата биће аутоматски уклоњени."
        ]
    },
    {
        "id": 47,
        "title": "Наставак rebase-овања након решавања конфликата",
        "description": "Током rebase-овања commit-ова могу се појавити конфликти ако су исте линије измењене у различитим commit-овима. Git ће паузирати rebase-овање и омогућити Вам да ручно решите конфликте пре наставка.\n\nПокренули Сте rebase-овање које је наишло на конфликте. Решите конфликте у погођеним фајловима и наставите процес.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Прво проверите статус командом 'git status' да бисте видели који фајлови имају конфликте.",
            "Измените конфликтни фајл да бисте разрешили маркере конфликата (<<<<<<, ======, >>>>>>).",
            "Stage-ујте разрешени фајл помоћу 'git add <filename>'.",
            "Наставите rebase-овање командом 'git rebase --continue'."
        ]
    },
    {
        "id": 48,
        "title": "Прескакање (енг. skip) commit-а током интерактивног rebase-овања",
        "description": "Понекад током rebase-овања наиђете на commit који изазива конфликте или проблеме које је тешко решити. Git Вам омогућава да у потпуности прескочите проблематичне commit-ове коришћењем --skip flag-а.\n\nПокренули Сте rebase-овање које је наишло на проблематичан commit. Прескочите тренутни commit и наставите процес.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git rebase --skip' да бисте прескочили тренутни проблематичан commit.",
            "Овим ће проблематичан commit бити одбачен и rebase-овање ће се наставити са преосталим commit-овима.",
            "Rebase-овање би требало аутоматски да се заврши након прескакања проблематичног commit-а."
        ]
    },
    {
        "id": 49,
        "title": "Проналажење аутора сваке линије у фајлу",
        "description": "Понекад је потребно да видите ко је написао коју линију фајла и када је последњи пут измењена. Команда git blame приказује информације о ауторству за сваку линију фајла.\n\nКористите git blame да бисте видели информације о ауторству за фајл 'README.md'.",
        "difficulty": "Лако",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git blame <filename>' да бисте видели информације о ауторству по линијама.",
            "blame команда приказује commit hash, аутора, временску ознаку и број линије за сваку линију.",
            "Пробајте 'git blame README.md' да бисте видели ко је написао коју линију README фајла."
        ]
    },
    {
        "id": 50,
        "title": "Проналажење commit-а који је увео одређену измену",
        "description": "Понекад је потребно да пронађете када је одређени део кода или текста додат у codebase. Git пружа моћне могућности претраге које Вам помажу да пронађете commit-ове који су додали или уклонили одређени садржај.\n\nФункција под називом 'authenticateUser' је у неком тренутку додата у codebase. Користите Git-ову pickaxe функционалност да бисте пронашли commit који је увео ову функцију.",
        "difficulty": "Средње",
        "category": "Rebase-овање и историја",
        "hints": [
            "Користите 'git log -S \"authenticateUser\"' да бисте пронашли commit-ове који су додали или уклонили функцију authenticateUser.",
            "Flag -S (pickaxe) тражи commit-ове где се број појављивања траженог стринга променио.",
            "Такође можете користити 'git log -G \"pattern\"' за претрагу commit-ова који су додали или уклонили линије које одговарају регуларном изразу."
        ]
    }
]