[
    {
        "id": 91,
        "title": "Аутоматско GPG потписивање commit-ова",
        "description": "GPG (GNU Privacy Guard) омогућава криптографско потписивање commit-ова ради провере њихове аутентичности. Ово осигурава да commit-ови заиста потичу од Вас и да није било манипулације. Подесите Git да аутоматски потписује све commit-ове Вашим GPG кључем.\n\nПодесите GPG потписивања commit-ова:\n1. Подесите Ваш GPG кључ за потписивање (користите 'ABC123DEF456' као ID кључа)\n2. Омогућите аутоматско потписивање commit-ова\n3. Направите потписан commit ради провере конфигурације",
        "difficulty": "Средње",
        "category": "Стручњак",
        "hints": [
            "Користите 'git config --global user.signingkey <key-id>' да бисте подесили Ваш GPG кључ за потписивање.",
            "Користите 'git config --global commit.gpgsign true' да бисте омогућили аутоматско потписивање commit-ова.",
            "ID кључа за ову вежбу је 'ABC123DEF456'.",
            "Након конфигурације направите commit како бисте проверили да ли потписивање функционише.",
            "GPG конфигурацију можете проверити командом 'git config --list | grep gpg'."
        ]
    },
    {
        "id": 92,
        "title": "Squash-овање више commit-ова у један приликом спајања гране",
        "description": "Понекад желите да спојите feature грану, али да задржите чисту историју тако што ћете све commit-ове са feature гране објединити у један commit. Ово се назива 'squash merge' и изводи се помоћу 'git merge --squash'.\n\nFeature грана под називом 'feature-cleanup' садржи више мањих commit-ова који треба да буду обједињени у један commit приликом спајања у main. Користите squash merge да бисте спојили све commit-ове из 'feature-cleanup' у један commit са поруком 'Implement cleanup feature'.",
        "difficulty": "Средње",
        "category": "Стручњак",
        "hints": [
            "Користите 'git merge --squash feature-cleanup' да бисте squash-овали све commit-ове са feature гране.",
            "Након squash merge операције, измене су stage-оване али још увек нису commit-оване.",
            "Користите 'git commit -m \"Implement cleanup feature\"' да бисте креирали коначни squash-овани commit.",
            "Проверите 'git log --oneline' да бисте видели да је додат само један commit.",
            "Оригинални commit-ови са feature гране се неће појавити у историји main гране."
        ]
    },
    {
        "id": 93,
        "title": "Преписивање историје гране и force push",
        "description": "Понекад је потребно очистити историју commit-ова пре дељења са другима. Ово подразумева преписивање историје (коришћењем интерактивног rebase-а), а затим force push-овање измена ради ажурирања удаљене гране. Ово је корисно за squash-овање commit-ова, исправљање commit порука или промену редоследа commit-ова пре спајања.\n\nПрепишите историју тренутне гране тако што ћете squash-овати последња 2 commit-а у 1, а затим force push-ујте измене у удаљени репозиторијум.",
        "difficulty": "Тешко",
        "category": "Стручњак",
        "hints": [
            "Користите 'git rebase -i HEAD~2' да бисте покренули интерактивни rebase последња 2 commit-а.",
            "Промените 'pick' у 'squash' (или 's') за други commit како бисте га squash-овали у први.",
            "Након завршетка rebase-а, користите 'git push --force' или 'git push -f' за ажурирање удаљене гране.",
            "Будите опрезни са force push-ом - преписује удаљену историју и може утицати на друге сараднике.",
            "Можете користити 'git push --force-with-lease' за безбеднији force push."
        ]
    },
    {
        "id": 94,
        "title": "Уклањање осетљивих података из историје помоћу git filter-branch",
        "description": "Понекад се осетљиви подаци попут лозинки, API кључева или личних информација случајно commit-ују у репозиторијум. Просто брисање фајла у новом commit-у није довољно - осетљиви подаци и даље постоје у Git историји и доступни су свима који имају приступ репозиторијуму.\n\nФајл под називом 'secrets.txt' који садржи осетљиве API кључеве је случајно commit-ован у историју репозиторијума. Користите 'git filter-branch' да бисте у потпуности уклонили овај фајл из свих commit-ова у историји репозиторијума и обезбедите уклањање празних commit-ова.\n\nВажно: Ова операција преписује историју и треба је пажљиво извести у дељеним репозиторијумима. Пожељно је коришћење екстерног алата као што је filter-repo.",
        "difficulty": "Тешко",
        "category": "Стручњак",
        "hints": [
            "Користите 'git filter-branch --tree-filter \"rm -f secrets.txt\" --prune-empty --all' да бисте уклонили фајл из историје.",
            "--tree-filter ради над Working Directory-јем сваког commit-а.",
            "Користите --prune-empty за уклањање commit-ова који постану празни након филтрирања.",
            "Flag --all обезбеђује обраду свих грана.",
            "Алтернатива: Користите --index-filter 'git rm --cached --ignore-unmatch secrets.txt' ради бољих перформанси.",
            "Након филтрирања, осетљиви фајл не би требало да постоји ни у једном commit-у у историји."
        ]
    },
    {
        "id": 95,
        "title": "Преписивање историје commit-ова помоћу git rebase -i на више грана",
        "description": "Комплексни пројекти често захтевају чишћење историје commit-ова на више грана пре спајања. Имате пројекат са две feature гране чије историје commit-ова је потребно очистити.\n\nЗадаци:\n1. Пребаците се на грану 'feature-cleanup' и користите интерактивни rebase да squash-ујете последња 3 commit-а у 1\n2. Пребаците се на 'feature-refactor' грану и rebase-ујте је на 'main' грану\n3. Користите интерактивни rebase на грани 'feature-refactor' да бисте променили редослед commit-ова тако да 'refactor tests' дође пре 'refactor code'\n\nОво симулира припрему више feature грана за чисто спајање у main.",
        "difficulty": "Тешко",
        "category": "Стручњак",
        "hints": [
            "Користите 'git checkout feature-cleanup' да бисте се пребацили на прву грану.",
            "Користите 'git rebase -i HEAD~3' за покретање интерактивног rebase-а последња 3 commit-а.",
            "Промените 'pick' у 'squash' или 's' за commit-ове које желите да обједините.",
            "Промените грану командом 'git checkout feature-refactor'.",
            "Користите 'git rebase main' да бисте rebase-овали feature-refactor грану на main.",
            "Користите 'git rebase -i HEAD~2' да бисте променили редослед последња 2 commit-а.",
            "У rebase todo листи можете померати линије горе-доле ради промене редоследа commit-ова."
        ]
    },
    {
        "id": 96,
        "title": "Подешавање Git сервера за host-овање сопствених репозиторијума",
        "description": "Подешавање сопственог Git сервера Вам омогућава да приватно host-ујете репозиторијуме и контролишете приступ. Можете користити Git-ов уграђени daemon за једноставно сервирање или подесити напреднија решења.\n\nКреирајте bare репозиторијум под називом 'project.git', а затим покрените Git daemon да га сервира на подразумеваном порту (9418) са омогућеним receive-pack flag-ом како би други могли да push-ују измене.",
        "difficulty": "Тешко",
        "category": "Стручњак",
        "hints": [
            "Користите 'git init --bare project.git' да бисте креирали bare репозиторијум.",
            "Покрените Git daemon командом 'git daemon --base-path=. --enable=receive-pack'.",
            "Bare репозиторијуми немају Working Directory - садрже само Git податке.",
            "Flag --enable=receive-pack омогућава другим корисницима да push-ују на Ваш сервер.",
            "Сервер можете тестирати клонирањем помоћу 'git clone git://localhost/project.git'."
        ]
    },
    {
        "id": 97,
        "title": "Конверзија постојећег Git репозиторијума у bare репозиторијум",
        "description": "Понекад је потребно конвертовати обичан Git репозиторијум (са Working Directory-јем) у bare репозиторијум ради дељења или серверске употребе. Bare репозиторијум садржи искључиво Git податке, без Working Directory-ја.\n\nИмате обичан репозиторијум са неколико commit-ова. Конвертујте га у bare репозиторијум на путањи '../project-bare.git', уз очување свих commit-ова и грана.",
        "difficulty": "Средње",
        "category": "Стручњак",
        "hints": [
            "Користите 'git clone --bare . ../project-bare.git' да бисте направили bare копију тренутног репозиторијума.",
            "Bare репозиторијум нема Working Directory - садржи само Git податке.",
            "Такође можете користити и 'git clone --mirror' да бисте укључили све референце и удаљене гране.",
            "Након конверзије, проверите подешавање командом 'git config core.bare' у новом репозиторијуму.",
            "Bare репозиторијуми се обично именују са .git суфиксом."
        ]
    },
    {
        "id": 98,
        "title": "Коришћење git rev-list са напредним опцијама филтрирања",
        "description": "Команда 'git rev-list' је моћан Git алат ниског нивоа за пролазак кроз историју commit-ова. Подржава бројне опције за филтрирање и форматирање, што је чини изузетно флексибилном за анализу историје репозиторијума.\n\nКористите 'git rev-list' са следећим опцијама комбинованим у једној команди:\n- Бројање commit-ова уместо њиховог излиставања\n- Филтрирање тако да се прикажу само commit-ови аутора који садрже 'john'\n- Претрага commit порука за реч 'fix'\n- Искључивање merge commit-ова из резултата\n\nОва комбинација ће Вам дати број commit-ова који нису мerge од аутора 'john' који у commit поруци садрже 'fix'.",
        "difficulty": "Средње",
        "category": "Стручњак",
        "hints": [
            "Flag --count чини да rev-list врати само број одговарајућих commit-ова.",
            "Flag --author филтрира commit-ове по имену аутора (делимична поклапања су подржана).",
            "Flag --grep претражује текст у commit порукама.",
            "Flag --no-merges искључује merge commit-ове из резултата.",
            "Све ове опције могу се комбиновати у једној rev-list команди.",
            "Користите 'git rev-list --count --author=\"john\" --grep=\"fix\" --no-merges HEAD'."
        ]
    },
    {
        "id": 99,
        "title": "Проналажење свих merge base-ова помоћу git merge-base --all",
        "description": "У комплексним репозиторијумима са више merge тачака, може постојати више од једног merge base-а између commit-ова. Користите git merge-base са --all flag-ом да бисте пронашли све могуће merge base-ове између три feature гране.\n\nПронађите све merge base-ове између 'feature-x', 'feature-y' и 'feature-z' коришћењем једне команде са --all flag-ом. Ово ће приказати све заједничке претке које ове гране деле.",
        "difficulty": "Тешко",
        "category": "Стручњак",
        "hints": [
            "Користите 'git merge-base --all feature-x feature-y feature-z' да бисте пронашли све заједничке претке.",
            "Flag --all приказује све merge base-ове, а не само најбољи.",
            "Код комплексних merge историја, више commit-ова могу бити merge base-ови.",
            "Структуру можете визуализовати помоћу 'git log --graph --oneline --all'."
        ]
    },
    {
        "id": 100,
        "title": "Master Git Clean - завршни изазов",
        "description": "Честитамо на доласку до завршног изазова! Ваш репозиторијум је сакупио различите типове непраћених фајлова и директоријума које је потребно пажљиво очистити.\n\nИмате:\n- Непраћене source фајлове које треба уклонити\n- Непраћене директоријуме које је потребно очистити\n- Одређене игнорисане фајлове (build артефакте) које такође треба уклонити\n- Фајл 'important-notes.txt' који треба бити сачуван\n\nИзвршите свеобухватну clean операцију која уклања непраћене фајлове и директоријуме, укључујући игнорисане фајлове, али изузима важан фајл са белешкама.",
        "difficulty": "Тешко",
        "category": "Чишћење и одржавање",
        "hints": [
            "Потребно је користити више flag-ова: -f (force), -d (директоријуми), -x (игнорисани фајлови).",
            "Користите -e да бисте изузели important-notes.txt фајл из clean операције.",
            "Комплетна команда гласи: git clean -fdx -e important-notes.txt",
            "Овом командом се уклањају непраћени фајлови, директоријуми и игнорисани фајлови, уз очување изузетог фајла."
        ]
    }
]