[
    {
        "id": 71,
        "title": "Fetch-овање измена са удаљеног репозиторијума без њиховог спајања",
        "description": "Понекад желите да видите које су измене доступне на удаљеном репозиторијуму, без да их одмах спајате у Вашу тренутну грану. Команда 'git fetch' преузима измене, али их не спаја, омогућавајући Вам да их прво прегледате.\n\nFetch-ујте најновије измене са удаљеног 'origin' репозиторијума без њиховог спајања у Вашу тренутну грану.",
        "difficulty": "Лако",
        "category": "Сарадња",
        "hints": [
            "Користите 'git fetch origin' да бисте преузели измене са удаљеног origin репозиторијума.",
            "За разлику од 'git pull', fetch не спаја измене у Вашу тренутну грану.",
            "Након fetch-овања, можете користити 'git log origin/main' да бисте видели које су измене доступне.",
            "Користите 'git status' да бисте видели да Ваша локална грана заостаје за удаљеном граном."
        ]
    },
    {
        "id": 72,
        "title": "Ресетовање локалних измена да би се поклопиле са удаљеном граном",
        "description": "Понекад се Ваша локална грана одвоји од удаљене гране и желите да одбаците све локалне измене како би се стање у потпуности поклопило са оним на удаљеној грани. Ово је корисно када желите да напустите локални рад и синхронизујете се са удаљеним стањем.\n\nИмате локалне измене које су у конфликту са удаљеном 'origin/main' граном. Ресетујте Вашу локалну грану тако да се у потпуности поклопи са удаљеном граном.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Прво користите 'git fetch' да бисте добили најновије удаљене измене.",
            "Користите 'git reset --hard origin/main' да бисте ресетовали локалну грану да одговара удаљеној.",
            "Ово ће одбацити све локалне измене и commit-ове који нису на удаљеној грани.",
            "Будите опрезни – ову операцију није лако поништити!"
        ]
    },
    {
        "id": 73,
        "title": "Спајање удаљених измена уз задржавање локалних измена",
        "description": "Имате локалне измене у Working Directory-ју, али постоје и нове измене на удаљеном репозиторијуму. Потребно је да спојите удаљене измене, а да при томе сачувате Ваш локални рад. Ово се може урадити тако што ћете stash-овати измене, повући удаљене измене, а затим повратити stash, или тако што ћете прво commit-овати измене.\n\nИмате локалне измене, а удаљени репозиторијум садржи нове commit-ове. Спојите удаљене измене уз задржавање локалних измена.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Можете користити 'git stash' да бисте привремено сачували локалне измене.",
            "Након stash-овања, користите 'git pull' да бисте повукли удаљене измене.",
            "Затим користите 'git stash pop' да бисте вратили локалне измене.",
            "Алтернативно, можете прво commit-овати локалне измене, а затим урадити pull.",
            "Користите 'git status' да бисте проверили стање Working Directory-ја."
        ]
    },
    {
        "id": 74,
        "title": "Cherry-pick-овање commit-а са друге гране",
        "description": "Понекад је потребно да примените одређени commit са једне гране на другу, без спајања целе гране. Команда 'git cherry-pick' Вам омогућава да копирате commit са једне гране и примените га на Вашу тренутну грану.\n\nИмате feature грану са корисним commit-ом који желите да примените на Вашу main грану. Cherry-pick-ујте commit са ID-јем 'abc1234' са feature гране на Вашу тренутну грану.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Користите 'git log feature-branch' да бисте видели commit-ове на feature грани.",
            "Користите 'git cherry-pick <commit-id>' да бисте применили одређени commit на тренутну грану.",
            "Уверите се да се налазите на циљаној грани пре cherry-pick-овања.",
            "Cherry-pick креира нови commit са истим изменама, али другачијим commit ID-јем."
        ]
    },
    {
        "id": 75,
        "title": "Force push-овање након преписивања историје",
        "description": "Након преписивања Git историје (на пример помоћу rebase или amend), Ваша локална грана ће се одвојити од удаљене гране. Обичан push ће бити одбијен, па је потребно да користите force push како бисте преписали удаљену историју. Ово је потенцијално опасно, јер може преписати рад других људи.\n\nПреписали Сте историју commit-ова локално и потребно је да force push-ујете измене како бисте ажурирали удаљену грану. Користите force push да бисте ажурирали удаљени 'origin' репозиторијум.",
        "difficulty": "Тешко",
        "category": "Сарадња",
        "hints": [
            "Користите 'git push --force' или 'git push -f' да бисте force push-овали измене.",
            "Force push преписује удаљену грану Вашом локалном верзијом.",
            "Будите веома опрезни са force push-ом – може преписати рад других људи!",
            "Можете користити 'git push --force-with-lease' за безбеднији force push.",
            "Проверите 'git log --oneline' да бисте видели преписану историју пре push-овања."
        ]
    },
    {
        "id": 76,
        "title": "Push-овање и постављање upstream-а за нову удаљену грану",
        "description": "Када креирате локалну грану и желите да је по први пут push-ујете на удаљени репозиторијум, потребно је да подесите upstream релацију праћења. Ово омогућава да будуће 'git push' и 'git pull' команде раде без навођења имена удаљеног репозиторијума и гране.\n\nИмате локалну грану 'feature-login' са неколико commit-ова коју је потребно push-овати на удаљени репозиторијум. Користите git push са upstream flag-ом да бисте у једној команди креирали удаљену грану и подесили праћење.",
        "difficulty": "Лако",
        "category": "Сарадња",
        "hints": [
            "Користите 'git push --set-upstream origin feature-login' да бисте push-овали и подесили upstream у једној команди.",
            "Такође можете користити и скраћени облик 'git push -u origin feature-login'.",
            "Ово креира удаљену грану и поставља праћење, тако да будући push-еви не морају да наводе удаљену грану.",
            "Уверите се да се налазите на 'feature-login' грани када извршавате команду."
        ]
    },
    {
        "id": 77,
        "title": "Подешавање upstream-а за постојећу удаљену грану",
        "description": "Понекад имате локалну грану која треба да прати постојећу удаљену грану, али релација праћења још увек није подешена. Ово се често дешава када креирате локалну грану из удаљене гране или када радите са гранама које су креирали други чланови тима.\n\nИмате локалну 'feature-auth' грану и већ постоји удаљена грана 'origin/feature-auth'. Подесите Вашу локалну грану да прати постојећу удаљену грану.",
        "difficulty": "Лако",
        "category": "Сарадња",
        "hints": [
            "Користите 'git branch -u origin/feature-auth' да бисте подесили upstream за тренутну грану.",
            "Такође можете користити и 'git branch --set-upstream-to=origin/feature-auth feature-auth' за експлицитније подешавање.",
            "Уверите се да се налазите на грани 'feature-auth', или наведите име гране у команди.",
            "Немојте користити 'git push -u' за овај изазов – то је намењено креирању нових удаљених грана."
        ]
    },
    {
        "id": 78,
        "title": "Rebase-овање feature гране на main",
        "description": "Имате feature грану која је креирана на основу старије верзије main гране. У међувремену, main грана је добила нове commit-ове. Rebase-овање feature гране на најновију main грану одржава чисту, линеарну историју тако што поставља Ваше feature commit-ове након најновијих main commit-ова, избегавајући непотребне merge commit-ове. Ова пракса такође обезбеђује да feature ради са најновијим изменама кода и чини историју пројекта лакшом за читање и разумевање.\n\nПребаците се на грану 'feature-payment' и rebase-ујте је на 'main' како бисте је ажурирали.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Прво се пребаците на feature грану командом 'git checkout feature-payment'.",
            "Затим користите 'git rebase main' да бисте rebase-овали feature грану на main.",
            "Ово ће поставити Ваше feature commit-ове након најновијих main commit-ова.",
            "Уколико дође до конфликата, решите их и користите 'git rebase --continue'."
        ]
    },
    {
        "id": 79,
        "title": "Безбедно руковање detached HEAD стањем ради истраживања",
        "description": "Када checkout-ујете одређени commit, улазите у 'detached HEAD' стање, у коме се не налазите ни на једној грани. Ово је корисно за истраживање старог кода или тестирање измена, али commit-ови направљени у овом стању могу бити изгубљени ако се њима правилно не управља. Безбедан начин рада у detached HEAD стању је креирање нове гране уколико желите да задржите измене.\n\nCheckout-ујте commit 'abc5678' да бисте ушли у detached HEAD стање, а затим креирајте нову грану под именом 'exploration' како бисте обезбедили сигуран развој.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Користите 'git checkout abc5678' да бисте checkout-овали одређени commit (ово уводи detached HEAD стање).",
            "Git ће Вас упозорити на detached HEAD стање – ово је нормално.",
            "Креирајте нову грану командом 'git checkout -b exploration' или 'git switch -c exploration'.",
            "Ово чини Вашу позицију безбедном за прављење commit-ова без губитка измена."
        ]
    },
    {
        "id": 80,
        "title": "Синхронизација fork-а са upstream репозиторијумом",
        "description": "У сарадничком развоју, често радите са fork-ом оригиналног репозиторијума. Ваш fork (origin) може да застари када оригинални репозиторијум (upstream) добије нове commit-ове од других сарадника. Потребно је да синхронизујете Ваш fork са upstream репозиторијумом како бисте остали у току са најновијим изменама.\n\nИмате fork-овани репозиторијум са 'origin' који показује на Ваш fork и 'upstream' који показује на оригинални репозиторијум. Upstream репозиторијум садржи нове commit-ове које је потребно да повучете у локални репозиторијум, а затим push-ујете на Ваш fork како би остао синхронизован.",
        "difficulty": "Средње",
        "category": "Сарадња",
        "hints": [
            "Прво fetch-ујте најновије измене са upstream-а командом 'git fetch upstream'.",
            "Уверите се да се налазите на main грани командом 'git checkout main'.",
            "Спојите upstream измене командом 'git merge upstream/main'.",
            "Push-ујте ажурирану main грану на Ваш fork командом 'git push origin main'.",
            "Овај процес одржава Ваш fork синхронизованим са оригиналним репозиторијумом."
        ]
    }
]