[
    {
        "id": 61,
        "title": "Checkout-овање претходног commit-а без мењања историје",
        "description": "Понекад је потребно да испитате стање Вашег кода у одређеном тренутку у историји, без креирања нове гране или мењања историје commit-ова. Git Вам омогућава да директно checkout-ујете одређени commit, чиме улазите у стање 'detached HEAD'.\n\nСумњате да је commit 'abc123def' увео bug. Checkout-ујте тај commit како бисте проверили код у том тренутку.",
        "difficulty": "Средње",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git checkout <commit-id>' да бисте директно checkout-овали одређени commit.",
            "Ово ће Вас довести у стање 'detached HEAD' - нисте ни на једној грани.",
            "Можете користити цео commit ID или само првих 7 карактера: 'abc123d'.",
            "Користите 'git log' да бисте видели доступне commit-ове и њихове ID-еве."
        ]
    },
    {
        "id": 62,
        "title": "Преглед фајлова који измењени у одређеном commit-у",
        "description": "Понекад је потребно да видите који су фајлови измењени у одређеном commit-у, без приказивања комплетног diff садржаја. Git пружа опције које приказују само називе фајлова који су измењени.\n\nКористите git show да бисте приказали само називе фајлова који су измењени у commit-у 'abc789def' (commit који имплементира аутентификацију).",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git show --name-only <commit-id>' да бисте приказали само називе измењених фајлова.",
            "Такође можете користити и 'git show --name-status <commit-id>' да бисте видели називе фајлова са статусом промене.",
            "Commit ID 'abc789def' имплементира систем аутентификације корисника."
        ]
    },
    {
        "id": 63,
        "title": "Приказ измена уведених commit-ом",
        "description": "Понекад је потребно да видите тачно које су измене направљене у одређеном commit-у. Команда 'git show' приказује информације о commit-у заједно са стварним изменама (diff) које је тај commit увео.\n\nКористите git show да бисте приказали измене уведене commit-ом 'abc123def'.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git show <commit-id>' да бисте приказали измене уведене одређеним commit-ом.",
            "Команда git show приказује и метаподатке commit-а и стварни diff.",
            "Можете користити цео commit ID или само првих неколико карактера."
        ]
    },
    {
        "id": 64,
        "title": "Излиставање commit-ова на одређеној грани који нису на main-у",
        "description": "Приликом рада са више грана, често је потребно да видите који commit-ови постоје на feature грани, а још увек нису спојени у main грану. Git пружа неколико начина за поређење грана и приказ commit-ова који постоје на једној грани, али не и на другој.\n\nИмате 'feature' грану која садржи commit-ове који нису на 'master' грани. Користите git log да бисте приказали само commit-ове који постоје на 'feature' грани, али не и на 'master' грани.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git log master..feature' да бисте приказали commit-ове који су на feature-у, али не и на master-у.",
            "Такође можете користити и 'git log feature --not master' за исти резултат.",
            "Синтакса '..' значи 'commit-ови доступни са десне стране, али не и са леве стране'.",
            "Додајте '--oneline' да бисте добили сажетији приказ commit-ова."
        ]
    },
    {
        "id": 65,
        "title": "Провера историје одређеног фајла",
        "description": "Понекад је потребно да видите историју commit-ова за одређени фајл како бисте разумели како се мењао током времена. Git Вам омогућава да филтрирате log и прикажете само commit-ове који су утицали на одређени фајл.\n\nЖелите да видите историју измена фајла под називом 'config.js'. Користите git log да бисте приказали само commit-ове који су мењали овај фајл.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git log <filename>' да бисте приказали commit-ове који су мењали одређени фајл.",
            "Такође можете користити и 'git log --follow <filename>' да бисте пратили фајл кроз промене имена.",
            "Додајте '--oneline' да бисте добили сажетији приказ историје фајла."
        ]
    },
    {
        "id": 66,
        "title": "Приказ разлика између два commit-а",
        "description": "Понекад је потребно да видите шта се променило између два одређена commit-а. Git Вам омогућава да упоредите било која два commit-а и видите разлике у њиховом садржају.\n\nЖелите да видите разлике између commit-а 'abc123def' (функционалност са bug-ом) и commit-а 'def456abc' (исправка стилова). Користите git diff да бисте приказали измене између ова два commit-а.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git diff <commit1> <commit2>' да бисте приказали разлике између два commit-а.",
            "Такође можете користити и 'git diff <commit1>..<commit2>' за исти резултат.",
            "Редослед је битан - 'git diff A B' приказује шта се променило од A ка B.",
            "Користите 'git log --oneline' да бисте видели доступне commit-ове и њихове ID-еве."
        ]
    },
    {
        "id": 67,
        "title": "Упоређивање две гране и приказ њихове разлике",
        "description": "Приликом рада са више грана, често је потребно да видите које промене постоје између њих. Git пружа неколико начина за поређење грана и приказ разлика у њиховом садржају.\n\nИмате 'feature' грану и 'master' грану. Користите git diff да бисте приказали разлике између ове две гране.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git diff <branch1> <branch2>' да бисте упоредили две гране.",
            "Такође можете користити и 'git diff <branch1>..<branch2>' за исти резултат.",
            "Редослед је битан - 'git diff A B' приказује шта се променило од A ка B.",
            "Користите 'git branch' да бисте видели доступне гране."
        ]
    },
    {
        "id": 68,
        "title": "Проналазак commit-ова одређеног аутора",
        "description": "Понекад је потребно да пронађете све commit-ове које је направио одређени аутор, како бисте пратили његов допринос или прегледали његов рад. Git Вам омогућава да филтрирате историју commit-ова према имену или email-у аутора.\n\nЖелите да видите све commit-ове које је направио 'John Smith'. Користите git log да бисте приказали само commit-ове чији је аутор ова особа.",
        "difficulty": "Лако",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git log --author=\"John Smith\"' да бисте приказали commit-ове одређеног аутора.",
            "Можете користити делимично поклапање: 'git log --author=john' ће пронаћи 'John Smith'.",
            "Подразумевано, поклапање аутора није осетљиво на величину слова слова.",
            "Можете комбиновати --author са другим flag-овима попут --oneline ради сажетијег резултата."
        ]
    },
    {
        "id": 69,
        "title": "Враћање (енг. restore) обрисане гране",
        "description": "Понекад случајно обришете грану која Вам је и даље потребна. Git помоћу reflog-а памти где су гране показивале чак и након што буду обрисане. Можете повратити обрисану грану тако што ћете пронаћи њен последњи commit и поново га креирати.\n\nСлучајно Сте обрисали грану 'feature-login'. Користите git reflog да бисте пронашли где је показивала и повратили је.",
        "difficulty": "Средње",
        "category": "Debug-овање",
        "hints": [
            "Користите 'git reflog' да бисте видели историју померања HEAD-а и пронашли где је обрисана грана показивала.",
            "Потражите уносе попут 'checkout: moving from feature-login to master' како бисте пронашли последњи commit гране.",
            "Користите 'git checkout -b feature-login <commit-id>' да бисте поново креирали грану на том commit-у.",
            "Такође можете користити и 'git branch feature-login <commit-id>' ако се не налазите на грани коју желите да креирате."
        ]
    },
    {
        "id": 70,
        "title": "Идентификација commit-а који је увео bug користећи git bisect",
        "description": "Git bisect је моћан алат за проналажење тачног commit-а који је увео bug, користећи бинарну претрагу. Процес започињете означавањем познатог доброг commit-а и познатог лошег commit-а, након чега Вас Git води кроз тестирање commit-ова док не пронађе први лош commit.\n\nЗнате да је commit 'abc123def' лош (садржи bug), а commit 'xyz789abc' добар (не садржи bug). Користите git bisect да бисте идентификовали који commit је увео bug.",
        "difficulty": "Тешко",
        "category": "Debug-овање",
        "hints": [
            "Започните са 'git bisect start' како бисте покренули процес поделе (бисекције).",
            "Користите 'git bisect bad <commit-id>' да бисте означили познати лош commit.",
            "Користите 'git bisect good <commit-id>' да бисте означили познати добар commit.",
            "Git ће checkout-овати commit-ове које треба да тестирате - сваки означите као 'git bisect good' или 'git bisect bad'.",
            "Наставите док Git не идентификује први лош commit.",
            "Када завршите, користите 'git bisect reset' да бисте се вратили на Вашу оригиналну грану."
        ]
    }
]