[
    {
        "id": 51,
        "title": "Stash-овање измена које нису commit-оване",
        "description": "Понекад радите на нечему, али је потребно да брзо промените контекст или повучете измене из удаљеног репозиторијума. Git stash Вам омогућава да привремено сачувате измене које нису commit-оване без креирања commit-а.\n\nИмате неке измене које нису commit-оване у Working Directory-ју. Користите git stash да бисте сачували ове измене како бисте могли да радите на нечему другом, а њима се можете касније вратити.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash' или 'git stash push' да бисте сачували измене које нису commit-оване.",
            "Након stash-овања, Working Directory би требало да буде чист.",
            "Касније можете вратити измене помоћу 'git stash pop' или 'git stash apply'."
        ]
    },
    {
        "id": 52,
        "title": "Приказ листе свих stash-ованих измена",
        "description": "Git Вам омогућава да прикажете све stash-оване измене коришћењем команде stash list. Ово Вам приказује све stash-еве које Сте сачували, заједно са њиховим порукама и stash ID-евима.\n\nИмате постојеће stash-оване измене. Користите Git да бисте приказали листу свих stash-ованих измена.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash list' да бисте приказали све stash-оване измене.",
            "Сваки stash унос приказује stash ID (stash@{0}, stash@{1}, итд.) и stash поруку.",
            "Најновији stash се налази на врху листе (stash@{0})."
        ]
    },
    {
        "id": 53,
        "title": "Примена (енг. apply) последњег stash-а без његовог уклањања",
        "description": "Понекад желите да примените stash-оване измене на Working Directory, али да задржите stash унос за потенцијалну будућу употребу. Команда 'git stash apply' примењује stash без његовог уклањања из листе stash-ева, за разлику од 'git stash pop' која га уклања.\n\nИмате stash-оване измене које желите да примените на Working Directory, али желите да задржите stash унос у случају да Вам поново затреба.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash apply' да бисте применили последњи stash без његовог уклањања из листе stash-ева.",
            "За разлику од 'git stash pop' команде, 'git stash apply' задржава stash унос за будућу употребу.",
            "Можете проверити да ли stash након примене и даље постоји помоћу 'git stash list'."
        ]
    },
    {
        "id": 54,
        "title": "Примена одређеног stash-а",
        "description": "Када имате више stash-ева, можете применити одређени тако што ћете референцирати његов индекс. Сваки stash је нумерисан почев од 0, где је stash@{0} најновији, stash@{1} други по реду, и тако даље.\n\nИмате више stash-ованих измена. Примените други stash унос (stash@{1}) без његовог уклањања из листе stash-ева.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash list' да бисте видели све доступне stash уносе.",
            "Користите 'git stash apply stash@{1}' да бисте применили други stash унос.",
            "Такође можете користити и краћи облик 'git stash apply 1'.",
            "Stash унос stash@{1} треба да остане у листи stash-ева након примене."
        ]
    },
    {
        "id": 55,
        "title": "Уклањање (енг. drop) одређеног stash-а",
        "description": "Понекад желите да уклоните одређени stash унос без да га примените. Команда 'git stash drop' омогућава циљање одређеног stash-а на основу његове референце (stash@{1}, stash@{2}, итд.).\n\nИмате више stash-ованих измена. Уклоните други stash унос (stash@{1}) без да га примените.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash list' да бисте видели све доступне stash уносе.",
            "Користите 'git stash drop stash@{1}' да бисте уклонили други stash унос.",
            "Такође можете користити и краћи облик 'git stash drop 1'.",
            "Stash унос stash@{1} треба да буде уклоњен из листе stash-ева након ове операције."
        ]
    },
    {
        "id": 56,
        "title": "Креирање stash-а са прилагођеном поруком",
        "description": "При stash-овању измена, можете навести прилагођену поруку која ће Вам помоћи да препознате шта stash садржи. Ово је посебно корисно када имате више stash-ева и потребно је да се подсетите чему који служи.\n\nИмате неке измене које нису commit-оване у Working Directory-ју. Креирајте stash са прилагођеном поруком 'Work in progress on feature X'.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash push -m \"message\"' да бисте креирали stash са прилагођеном поруком.",
            "Такође можете користити и 'git stash save \"message\"' (застарело, али и даље ради).",
            "Порука треба да буде: 'Work in progress on feature X'.",
            "Након stash-овања, Working Directory би требало да буде чист."
        ]
    },
    {
        "id": 57,
        "title": "Stash-овање непраћених фајлова",
        "description": "Подразумевано, git stash чува само праћене фајлове који су измењени. Понекад желите да stash-ујете и непраћене фајлове (фајлови који још увек нису додати на Git). Користите flag --include-untracked да бисте stash-овали и праћене и непраћене фајлове.\n\nИмате неке измењене праћене фајлове и нове непраћене фајлове. Stash-ујте их све, укључујући и непраћене фајлове.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash -u' или 'git stash --include-untracked' да бисте stash-овали и непраћене фајлове.",
            "Такође можете користити и 'git stash push -u' са истим ефектом.",
            "Након stash-овања, и праћени и непраћени фајлови треба да буду сачувани, а Working Directory потпуно чист."
        ]
    },
    {
        "id": 58,
        "title": "Примена (енг. pop) последњег stash-а и његово уклањање",
        "description": "Команда 'git stash pop' примењује најновији stash на Working Directory и уклања га из листе stash-ева. Ово се разликује од 'git stash apply' која задржава stash унос након примене.\n\nИмате stash-оване измене које желите да примените на Working Directory и да их трајно уклоните из листе stash-ева.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash pop' да бисте применили последњи stash и уклонили га из листе stash-ева.",
            "За разлику од 'git stash apply' команде, 'git stash pop' уклања stash унос након примене.",
            "Можете проверити да ли је stash уклоњен помоћу 'git stash list' након ове операције."
        ]
    },
    {
        "id": 59,
        "title": "Примена и уклањање (енг. pop) одређеног stash-а",
        "description": "Када имате више stash-ева, можете применити и уклонити одређени тако што ћете референцирати његов индекс. Команда 'git stash pop' са stash референцом примењује stash и уклања га из листе stash-ева.\n\nИмате више stash-ованих измена. Примените други stash унос (stash@{1}) и уклоните га из листе stash-ева.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash list' да бисте видели све доступне stash уносе.",
            "Користите 'git stash pop stash@{1}' да бисте применили и уклонили други stash унос.",
            "Такође можете користити и краћи облик 'git stash pop 1'.",
            "Stash унос stash@{1} треба да буде уклоњен из листе након ове операције."
        ]
    },
    {
        "id": 60,
        "title": "Брисање (енг. clear) свих stash-ованих измена",
        "description": "Понекад желите да трајно уклоните све stash-оване измене одједном. Команда 'git stash clear' уклања све stash-оване уносе из листе stash-ева. Будите опрезни са овом командом јер трајно брише све stash-оване измене.\n\nИмате више stash-ованих измена које Вам више нису потребне. Обришите све stash уносе да бисте очистили листу stash-ева.",
        "difficulty": "Лако",
        "category": "Stash-овање",
        "hints": [
            "Користите 'git stash clear' да бисте уклонили све stash уносе одједном.",
            "Ова команда трајно брише све stash-оване измене - користите је опрезно.",
            "Можете проверити да ли су сви stash-еви обрисани помоћу 'git stash list'."
        ]
    }
]