[
    {
        "id": 31,
        "title": "Измена последњег commit-а без промене поруке",
        "description": "Понекад схватите да Сте заборавили да stage-ујете фајл или Сте направили мању измену након commit-а. Git Вам омогућава да измените последњи commit и укључите додатне измене без креирања новог commit-а.\n\nИмате stage-оване измене које је требало укључити у последњи commit. Измените последњи commit тако да садржи ове измене, без промене commit поруке.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git commit --amend --no-edit' да бисте изменили последњи commit без промене поруке.",
            "Flag --amend мења последњи commit уместо креирања новог.",
            "Flag --no-edit задржава постојећу commit поруку."
        ]
    },
    {
        "id": 32,
        "title": "Измена последњег commit-а и ажурирање поруке",
        "description": "Понекад је потребно да измените поруку последњег commit-а или да му додате заборављене измене.\n\nВаш последњи commit има поруку 'Add new feature', али би требало да гласи 'Add user authentication feature'. Користите Git-ову amend функционалност да бисте ажурирали commit поруку.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git commit --amend -m \"Add user authentication feature\"' да бисте променили поруку последњег commit-а.",
            "Flag --amend мења најновији commit уместо креирања новог.",
            "Немојте користити --no-edit, јер би то задржало постојећу (погрешну) поруку."
        ]
    },
    {
        "id": 33,
        "title": "Поништавање последњег commit-а уз задржавање измена у stage-у",
        "description": "Понекад прерано направите commit и схватите да желите да направите додатне измене или исправите commit поруку. Git Вам омогућава да поништите последњи commit, а да притом stage-ујете постојеће измене, како бисте их могли додатно изменити и поново направити commit.\n\nВаш последњи commit је направљен прерано. Поништите га, али задржите измене у stage-у како бисте могли да наставите да радите на њима.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git reset --soft HEAD~1' да бисте поништили последњи commit и задржали измене у stage-у.",
            "Flag --soft чува stage-оване измене, за разлику од --hard који их одбацује.",
            "HEAD~1 се односи на commit пре тренутног HEAD-а (један commit уназад)."
        ]
    },
    {
        "id": 34,
        "title": "Поништавање последњег commit-а и уклањање измена из stage-а",
        "description": "Понекад желите да поништите commit, али да задржите измене у Working Directory-ју као фајлове који нису stage-овани. Ово Вам омогућава да додатно измените фајлове пре поновног commit-а.\n\nПоследњи commit је потребно поништити, а измене треба да остану у Вашем Working Directory-ју, али да не буду stage-оване.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git reset HEAD~1' да бисте поништили последњи commit и уклонили измене из stage-а.",
            "Мешовити ресет (подразумевани) помера HEAD уназад и уклања фајлове из stage-а, али задржава измене у Working Directory-ју.",
            "HEAD~1 се односи на commit пре тренутног HEAD-а (један commit уназад)."
        ]
    },
    {
        "id": 35,
        "title": "Уклањање фајла који је случајно додат из stage-а",
        "description": "Понекад случајно stage-ујете фајл који нисте намеравали да укључите у наредни commit. Git Вам омогућава да уклоните фајлове из stage-а без губитка измена у Working Directory-ју.\n\nСлучајно Сте stage-овали 'temp.log', а тај фајл не би требало да буде commit-ован. Уклоните овај фајл из stage-а, задржавајући измене у Working Directory-ју.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git reset HEAD temp.log' да бисте уклонили фајл из stage-а уз задржавање измена у Working Directory-ју.",
            "Такође можете користити и 'git reset temp.log' као скраћеницу за исту операцију.",
            "Фајл ће остати измењен у Вашем Working Directory-ју након уклањања из stage-а."
        ]
    },
    {
        "id": 36,
        "title": "Одбацивање (енг. discard) измена у фајлу које нису commit-оване",
        "description": "Понекад направите измене у фајлу, али схватите да желите да их одбаците и вратите фајл у стање последњег commit-а. Git Вам омогућава да одбаците измене у Working Directory-ју без утицаја на stage-оване измене.\n\nНаправили Сте измене у 'file.txt' које желите да одбаците. Користите Git да бисте вратили фајл у стање последњег commit-а.",
        "difficulty": "Лако",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git checkout -- file.txt' да бисте одбацили измене у фајлу.",
            "Такође можете користити и 'git restore file.txt' (Git 2.23+) за исти ефекат.",
            "Ово утиче само на измене које нису commit-оване у Working Directory-ју, а не на stage-оване измене."
        ]
    },
    {
        "id": 37,
        "title": "Revert-овање commit-а који је послат на удаљени репозиторијум",
        "description": "Понекад је потребно да поништите измене из commit-а који је већ послат на удаљени репозиторијум. За разлику од команде git reset, git revert креира нови commit који поништава измене, што га чини безбедним за дељене репозиторијуме.\n\nИмате commit са ID-јем 'abc123def' који је увео bug и потребно је да буде поништен. Користите git revert да бисте безбедно поништили његове измене.",
        "difficulty": "Средње",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git revert <commit-id>' да бисте креирали нови commit који поништава измене из наведеног commit-а.",
            "git revert је безбеднији од git reset за commit-ове који су већ послати на удаљене репозиторијуме.",
            "Команда revert ће отворити едитор за commit поруку, или можете користити -m да је директно наведете."
        ]
    },
    {
        "id": 38,
        "title": "Ресетовање гране на претходни commit (soft reset)",
        "description": "Понекад је потребно да ресетујете грану на претходни commit, уз задржавање измена у Staging Area. Ово Вам омогућава да поново commit-ујете измене са другачијом структуром или поруком.\n\nИмате commit-ове које је потребно поништити, али желите да задржите измене у stage-у. Ресетујте грану на commit 'abc123def' коришћењем soft reset-а.",
        "difficulty": "Средње",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git reset --soft <commit-id>' да бисте ресетовали на одређени commit уз задржавање измена у stage-у.",
            "Можете користити commit ID 'abc123def' или га пронаћи помоћу 'git log'.",
            "Soft reset помера HEAD уназад, али задржава Staging Area и Working Directory."
        ]
    },
    {
        "id": 39,
        "title": "Ресетовање гране на претходни commit (hard reset)",
        "description": "Понекад је потребно да у потпуности ресетујете грану на претходни commit, одбацујући све измене из Staging Area и Working Directory-ја. Ово је деструктивна операција која трајно уклања измене које нису commit-оване.\n\nИмате commit-ове који садрже bug-ове и желите да се у потпуности вратите на commit 'abc123def', одбацујући све накнадне измене. Користите hard reset да бисте то постигли.",
        "difficulty": "Средње",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git reset --hard <commit-id>' да бисте ресетовали на одређени commit и одбацили све измене.",
            "Можете користити commit ID 'abc123def' или га пронаћи помоћу 'git log'.",
            "Hard reset је деструктиван - трајно уклања све измене које нису commit-оване.",
            "Будите опрезни при коришћењу hard reset-а, јер га није лако поништити."
        ]
    },
    {
        "id": 40,
        "title": "Враћање (енг. restore) обрисаног фајла из претходног commit-а",
        "description": "Понекад случајно обришете фајл и commit-ујете брисање, али касније схватите да Вам је тај фајл и даље потребан. Git Вам омогућава да вратите фајлове из претходних commit-ова без утицаја на остале измене.\n\nФајл под називом 'important-config.txt' је обрисан у недавном commit-у. Вратите овај фајл из commit-а пре него што је обрисан (commit ID 'def456abc').",
        "difficulty": "Средње",
        "category": "Поништавање и поправка грешака",
        "hints": [
            "Користите 'git checkout <commit-id> -- <filename>' да бисте вратили фајл из одређеног commit-а.",
            "Такође можете користити и 'git restore --source=<commit-id> <filename>' (Git 2.23+).",
            "Commit ID 'def456abc' садржи верзију фајла коју желите да вратите.",
            "Након враћања, фајл ће бити stage-ован и спреман за commit."
        ]
    }
]